[
  {
    "word": "settings",
    "definition": "The time, place, and circumstances in which something occurs.",
    "examples": [
      "This kind of teamwork often leads to deeper connections than we form in other settings.",
      "The story takes place in a rural setting."
    ],
    "notes": "'Setting' ortam, bağlam, koşullar demektir. Çoğul haliyle farklı ortamları ifade eder."
  },
  {
    "word": "get together",
    "definition": "To meet socially or gather for a shared activity.",
    "examples": [
      "Let’s get together for coffee sometime.",
      "We usually get together with friends on weekends."
    ],
    "notes": "Bir araya gelmek, sosyal amaçlı buluşmak anlamındadır."
  },
  {
    "word": "come together",
    "definition": "To unite or work as a group, often toward a common goal.",
    "examples": [
      "People came together to support the victims.",
      "The team came together and won the game."
    ],
    "notes": "Bir araya gelmek, birleşmek, ortak bir amaç için toplanmak."
  },
  {
    "word": "had our families meet each other",
    "definition": "To cause someone to do something; this is a causative structure using 'have'.",
    "examples": [
      "We even had our families meet each other.",
      "They had the mechanic check the car before the trip."
    ],
    "notes": "‘Have + object + verb’ yapısı başkasına bir şey yaptırmak anlamındadır. (Causative structure)"
  },
  {
    "word": "meet with someone",
    "definition": "To have a formal or planned meeting with someone.",
    "examples": [
      "I met with the manager to discuss the proposal.",
      "She met with her advisor to go over the schedule."
    ],
    "notes": "Genellikle iş veya resmi konular için kullanılır."
  },
  {
    "word": "meet someone",
    "definition": "To come into contact with someone, either planned or by chance.",
    "examples": [
      "I met her at a conference.",
      "Have you ever met a celebrity?"
    ],
    "notes": "Biriyle tanışmak ya da karşılaşmak anlamındadır. 'With' kullanılmaz."
  },
  {
    "word": "proceeds",
    "definition": "The money earned from an event or activity.",
    "examples": [
      "Part of the proceeds goes towards a charitable cause.",
      "All proceeds from the concert will go to charity."
    ],
    "notes": "'Proceeds' gelir, kazanç anlamına gelir ve her zaman çoğul olarak kullanılır."
  },
  {
    "word": "charitable",
    "definition": "Related to giving help to those in need.",
    "examples": [
      "They donated to a charitable foundation.",
      "Charitable organizations help the poor and sick."
    ],
    "notes": "Hayırsever, yardım amaçlı demektir."
  },
  {
    "word": "compassionate",
    "definition": "Showing sympathy and concern for others’ suffering.",
    "examples": [
      "She is a compassionate nurse who cares for her patients deeply.",
      "He offered a compassionate response to the tragedy."
    ],
    "notes": "Şefkatli, merhametli anlamındadır."
  },
  {
    "word": "betterment",
    "definition": "The process of improving something.",
    "examples": [
      "They worked for the betterment of the community.",
      "Education plays a key role in social betterment."
    ],
    "notes": "İyileştirme, gelişme anlamındadır."
  },
  {
    "word": "marketing ploy",
    "definition": "A clever tactic used to attract customers or promote a product.",
    "examples": [
      "It turned out to be just a marketing ploy.",
      "Giving free samples is a common marketing ploy."
    ],
    "notes": "Pazarlama taktiği, dikkat çekici strateji."
  },
  {
    "word": "appealing to",
    "definition": "Attractive or interesting to a particular person or group.",
    "examples": [
      "The marketing ploy was aimed at appealing to people in their 20s.",
      "This style of music is appealing to younger audiences."
    ],
    "notes": "'Appealing to' ilgisini çekmek, cazip gelmek anlamındadır."
  },
  {
    "word": "charitable cause",
    "definition": "A purpose or organization focused on helping others in need.",
    "examples": [
      "The fundraiser supported a charitable cause.",
      "Many people donate to charitable causes during the holidays."
    ],
    "notes": "Yardım amaçlı faaliyet veya kuruluş, hayır işi."
  },
  {
    "word": "refute",
    "definition": "To prove that a statement or theory is wrong or false.",
    "examples": [
      "The scientist refuted the old theory with new evidence.",
      "She refuted his claim with clear facts."
    ],
    "notes": "'Refute', çürütmek, yanlış olduğunu kanıtlamak anlamındadır."
  },
  {
    "word": "undermine",
    "definition": "To weaken or damage something gradually or secretly.",
    "examples": [
      "Constant criticism can undermine a person's confidence.",
      "The scandal undermined the politician's credibility."
    ],
    "notes": "'Undermine', zayıflatmak, baltalamak anlamına gelir; genellikle gizli veya dolaylı yollarla olur."
  },
  {
    "word": "compelling rebuttals",
    "definition": "Powerful arguments or responses that effectively contradict or disprove a claim.",
    "examples": [
      "The lawyer presented compelling rebuttals to the accusations.",
      "Her essay included compelling rebuttals to opposing views."
    ],
    "notes": "'Rebuttal' bir iddiaya karşı güçlü cevap/çürütmedir. 'Compelling' burada 'inandırıcı, güçlü' anlamındadır."
  },
  {
    "word": "settle down",
    "definition": "To become calm, relaxed, or stable; to begin to live a quieter and more regular life.",
    "examples": [
      "The children finally settled down after the excitement.",
      "He decided to settle down and start a family."
    ],
    "notes": "Sakinleşmek, düzene girmek veya yerleşmek anlamındadır."
  },
  {
    "word": "stimulate",
    "definition": "To encourage or activate a process or function.",
    "examples": [
      "Melatonin release is stimulated by darkness.",
      "Caffeine can stimulate brain activity."
    ],
    "notes": "Uyarmak, harekete geçirmek anlamındadır."
  },
  {
    "word": "inhibit",
    "definition": "To slow down or prevent a process or reaction.",
    "examples": [
      "Melatonin release is inhibited by light.",
      "Fear can inhibit performance during public speaking."
    ],
    "notes": "Engellemek, baskılamak anlamındadır."
  },
  {
    "word": "alertness",
    "definition": "The quality of being attentive and ready to respond.",
    "examples": [
      "Lack of sleep affects mental alertness.",
      "Drivers must maintain alertness on long trips."
    ],
    "notes": "Uyanıklık, dikkatli olma durumu."
  },
  {
    "word": "advent of the electric light",
    "definition": "The arrival or beginning of something important; in this case, electric lighting.",
    "examples": [
      "The advent of the electric light changed how people sleep.",
      "With the advent of the internet, communication has become easier."
    ],
    "notes": "'Advent' bir şeyin gelişi veya ortaya çıkışı anlamındadır."
  },
  {
    "word": "convenience",
    "definition": "The state of being easy to use or suitable for a purpose.",
    "examples": [
      "Online shopping offers great convenience.",
      "People often choose convenience over health."
    ],
    "notes": "Kolaylık, elverişlilik anlamına gelir."
  },
  {
    "word": "psychological",
    "definition": "Related to the mind and mental processes.",
    "examples": [
      "Sleep deprivation has psychological effects.",
      "She received psychological support after the accident."
    ],
    "notes": "Psikolojik, zihinsel süreçlerle ilgili."
  },
  {
    "word": "physiological",
    "definition": "Related to the physical or biological functions of living organisms.",
    "examples": [
      "Stress causes physiological changes in the body.",
      "Sleep is essential for physiological recovery."
    ],
    "notes": "Fizyolojik, bedenin işleyişiyle ilgili."
  },
  {
    "word": "acute",
    "definition": "Severe or intense; also can mean sharp or highly developed.",
    "examples": [
      "She suffered from acute back pain.",
      "Acute stress can lead to serious health problems."
    ],
    "notes": "Şiddetli, yoğun, ani gelişen anlamına gelir."
  },
  {
    "word": "obesity",
    "definition": "The condition of being very overweight in a way that is unhealthy.",
    "examples": [
      "Obesity increases the risk of heart disease.",
      "Childhood obesity is a growing concern worldwide."
    ],
    "notes": "Aşırı şişmanlık, obezite durumu."
  },
  {
    "word": "go behind the wheel of a car",
    "definition": "To drive a car.",
    "examples": [
      "You shouldn’t go behind the wheel of a car when you’re tired.",
      "He went behind the wheel despite having a suspended license."
    ],
    "notes": "'Behind the wheel' araba kullanmak anlamına gelir."
  },
  {
    "word": "intoxication",
    "definition": "The state of being affected by alcohol or drugs.",
    "examples": [
      "Alcohol intoxication slows down reaction time.",
      "He was arrested for driving under intoxication."
    ],
    "notes": "Zehirlenme veya alkol/uyuşturucu etkisinde olma durumu."
  },
  {
    "word": "presumably",
    "definition": "Used to say that something is likely or assumed to be true.",
    "examples": [
      "Presumably, she missed the train and is running late.",
      "The lights are off, so presumably no one is home."
    ],
    "notes": "Muhtemelen, büyük ihtimalle anlamına gelir."
  },
  {
    "word": "to go into orbit around it",
    "definition": "To start moving in a curved path around a planet or object in space.",
    "examples": [
      "The satellite went into orbit around the Earth.",
      "The spacecraft will go into orbit around Mars next week."
    ],
    "notes": "'Orbit' yörünge anlamına gelir. 'Go into orbit' bir cismin başka bir cismin çevresinde dönmeye başlaması demektir."
  },
  {
    "word": "in composition",
    "definition": "Refers to the makeup or components of something.",
    "examples": [
      "There are too many similarities in composition between Earth and the moon.",
      "The composition of this rock includes various minerals."
    ],
    "notes": "'Composition' bir şeyin içeriği veya yapısı anlamındadır. 'In composition' ise 'yapısal olarak' veya 'bileşim bakımından' demektir."
  },
  {
    "word": "fission",
    "definition": "The process of splitting a nucleus into two or more parts, releasing energy.",
    "examples": [
      "Nuclear fission is used in power plants to generate electricity.",
      "Fission releases a large amount of energy."
    ],
    "notes": "Nükleer fizikte bir çekirdeğin bölünmesi anlamına gelir. Fiziksel bilimlerde önemli bir terim."
  },
  {
    "word": "remained independent from",
    "definition": "To continue existing or functioning separately from something else.",
    "examples": [
      "The country remained independent from colonial rule.",
      "The moon remained independent from the Earth after formation."
    ],
    "notes": "'Independent from' bağımsız olmak, bir şeyden etkilenmemek anlamına gelir."
  },
  {
    "word": "astronomers",
    "definition": "Scientists who study stars, planets, and other objects in space.",
    "examples": [
      "Astronomers discovered a new planet last year.",
      "Many astronomers use telescopes to observe distant galaxies."
    ],
    "notes": "'Astronomer' gökbilimci anlamındadır. Uzayla ilgili bilimsel çalışmaları yapan kişilerdir."
  },
  {
    "word": "was struck by",
    "definition": "To be hit suddenly and forcefully by something.",
    "examples": [
      "Earth was struck by an object approximately one-tenth of its mass.",
      "The car was struck by lightning during the storm."
    ],
    "notes": "'Strike' fiilinin geçmiş hali olan 'was struck by', bir şeyin aniden ve şiddetle vurulması anlamına gelir."
  },
  {
    "word": "to shutter",
    "definition": "To close or cause to close (usually windows or businesses).",
    "examples": [
      "Many shops had to shutter during the economic crisis.",
      "The old factory was shuttered last year."
    ],
    "notes": "'Shutter' genellikle dükkan ya da işletmelerin kapatılması anlamında kullanılır."
  },
  {
    "word": "to disrupt",
    "definition": "To interrupt or disturb the normal course of something.",
    "examples": [
      "Heavy rain disrupted the football match.",
      "The new policy disrupted the usual workflow."
    ],
    "notes": "Bir şeyin normal işleyişini bozmak, kesintiye uğratmak anlamındadır."
  },
  {
    "word": "to disturb",
    "definition": "To interrupt someone’s peace, rest, or concentration.",
    "examples": [
      "Please don’t disturb me while I’m working.",
      "The loud noise disturbed the students during the exam."
    ],
    "notes": "Rahatsız etmek, huzuru bozmak anlamına gelir."
  },
  {
    "word": "to eject",
    "definition": "To force someone or something to leave a place.",
    "examples": [
      "The pilot ejected from the plane just before it crashed.",
      "The machine ejected the faulty product."
    ],
    "notes": "Bir şeyi zorla dışarı atmak, fırlatmak anlamındadır."
  },
  {
    "word": "to impact",
    "definition": "To have a strong effect or influence on something.",
    "examples": [
      "The new law will impact many businesses.",
      "The asteroid impacted the Earth millions of years ago."
    ],
    "notes": "Hem ‘çarpma, darbe’ anlamı hem de ‘etkilemek, etki yapmak’ anlamı vardır."
  },
  {
    "word": "plausible",
    "definition": "Seeming reasonable or probable.",
    "examples": [
      "It is more plausible that the Earth and the moon were never connected.",
      "Her explanation was plausible, so everyone believed her."
    ],
    "notes": "'Plausible' mantıklı, akla yatkın, makul demektir."
  },
  {
    "word": "Earth’s crust",
    "definition": "The outermost solid layer of the Earth.",
    "examples": [
      "Earth’s crust is made of several large tectonic plates.",
      "Volcanoes erupt through cracks in Earth’s crust."
    ],
    "notes": "'Crust' kabuk anlamına gelir, burada Dünya’nın en dış katmanı."
  },
  {
    "word": "off (the western coast)",
    "definition": "Near or away from the coast or shore.",
    "examples": [
      "There is an island off the western coast of the country.",
      "The ship sank off the coast during the storm."
    ],
    "notes": "'Off' bir yerden biraz uzakta veya yakınında anlamında kullanılır."
  },
  {
    "word": "tear apart",
    "definition": "To separate something forcefully into pieces.",
    "examples": [
      "The storm tore apart many houses along the coast.",
      "The argument tore their friendship apart."
    ],
    "notes": "'Tear apart' parçalamak, yırtıp dağıtmak anlamındadır."
  },
  {
    "word": "consolidate",
    "definition": "To make something stronger, more solid, or more unified.",
    "examples": [
      "The company consolidated its position in the market.",
      "She tried to consolidate her notes before the exam."
    ],
    "notes": "Güçlendirmek, sağlamlaştırmak, birleştirmek. Hem soyut şeyler (güç, bilgi, kontrol), hem de somut şeyler için kullanılabilir."
  },
  {
    "word": "I know some Spanish, if that’s any consolation.",
    "definition": "Used to try to offer a small comfort or reassurance in an otherwise disappointing situation.",
    "examples": [
      "I know some Spanish, if that’s any consolation.",
      "We didn’t win, but at least we played well — if that’s any consolation."
    ],
    "notes": "‘If that’s any consolation’ ifadesi, ‘biraz teselli olursa, durumu hafifletirse’ anlamına gelir. Genellikle kötü bir haberi hafifletmeye çalışırken söylenir."
  },
  {
    "word": "They must have let someone go before who isn’t a Spanish major, right?",
    "definition": "Expresses a logical assumption about the past — that at some point, a non-Spanish major must have been allowed to go.",
    "examples": [
      "They must have let someone go before who isn’t a Spanish major, right?",
      "He must have told them already — they look upset."
    ],
    "notes": "‘Must have + V3’ yapısı, geçmişte olmuş olma ihtimali çok yüksek olan bir şeyi ifade eder (mantıksal çıkarım). ‘Let someone go’ burada birini gitmesine izin vermek anlamında kullanılmıştır."
  },
  {
    "word": "I can’t remember the last time a student was able to go who wasn’t a Spanish major.",
    "definition": "Used to express that something rarely (or never) happens — in this case, that non-Spanish majors almost never get the opportunity to go.",
    "examples": [
      "I can’t remember the last time a student was able to go who wasn’t a Spanish major.",
      "I can’t remember the last time it rained this hard in July."
    ],
    "notes": "Bu ifade, nadiren gerçekleşen ya da uzun zamandır olmayan bir durumu vurgular. ‘Spanish major’ ifadesi, üniversitede ana dalı İspanyolca olan öğrenci anlamına gelir. Cümledeki 'who wasn’t a Spanish major' kısmı, önceki ‘student’ kelimesini tanımlar."
  },
  {
    "word": "relevant",
    "definition": "Closely connected or appropriate to the matter at hand.",
    "examples": [
      "Please only include information that is relevant to the topic.",
      "Her comments were not relevant to the discussion."
    ],
    "notes": "Konu ile ilgili, alakalı, yerinde. Genellikle 'relevant to' şeklinde kullanılır."
  },
  {
    "word": "have one's heart set on",
    "definition": "To want something very much or be determined to achieve or get something.",
    "examples": [
      "She has her heart set on studying abroad.",
      "They have their hearts set on buying that house by the beach."
    ],
    "notes": "Bir şeyi çok istemek, gönlünü bir şeye kaptırmak. Genellikle uzun zamandır arzu edilen şeyler için kullanılır."
  },
  {
    "word": "Did you pick up your paper yet?",
    "definition": "A question asking if someone has collected or retrieved their document, assignment, or newspaper.",
    "examples": [
      "Did you pick up your paper yet from the front desk?",
      "I forgot to pick up my paper after class."
    ],
    "notes": "‘Pick up’ fiili burada ‘bir şeyi gidip almak, teslim almak’ anlamında kullanılır. ‘Paper’ kelimesi bağlama göre ‘gazete’, ‘ödev’ ya da ‘belge’ olabilir."
  },
  {
    "word": "dispel",
    "definition": "To drive away or eliminate a thought, feeling, or belief.",
    "examples": [
      "The other choices are mentioned at the beginning of the passage but later dispelled for various reasons.",
      "The scientist tried to dispel the myth with evidence."
    ],
    "notes": "Bir düşünceyi, şüpheyi veya yanılgıyı ortadan kaldırmak, dağıtmak. Genellikle soyut şeyler için kullanılır (örneğin: efsane, korku, şüphe)."
  },
  {
    "word": "narrative",
    "definition": "A story or an account of events, experiences, or the like, whether true or fictional.",
    "examples": [
      "The topic is introduced, followed by an example and a historical narrative.",
      "The documentary presents a compelling narrative of the war."
    ],
    "notes": "Anlatı, öykü ya da olayların anlatımı. Akademik metinlerde 'historical narrative' gibi ifadelerle sıkça kullanılır."
  },
  {
    "word": "we average",
    "definition": "To have an average amount, level, or number over time.",
    "examples": [
      "We average fewer than 7 hours of sleep per day by age 65.",
      "Americans average about 3 cups of coffee per day."
    ],
    "notes": "‘We average’ ifadesi, ‘ortalama olarak ... oluruz/yaparız’ anlamında kullanılır. Burada ‘we average fewer than 7 hours’ demek, ‘ortalama olarak günde 7 saatten az uyuruz’ demektir."
  },
  {
    "word": "sleep deprivation",
    "definition": "The condition of not having enough sleep.",
    "examples": [
      "Sleep deprivation can lead to serious health problems.",
      "College students often suffer from sleep deprivation during exam weeks."
    ],
    "notes": "Yeterince uyuyamama durumu, uyku eksikliği."
  },
  {
    "word": "I really wouldn't want you to get your hopes up.",
    "definition": "Used to warn someone not to expect too much, so they won’t be disappointed.",
    "examples": [
      "I really wouldn't want you to get your hopes up — the position hasn’t been confirmed yet.",
      "He said he might come, but I wouldn’t get my hopes up."
    ],
    "notes": "‘Get your hopes up’ ifadesi, ‘büyük umutlara kapılmak’ anlamına gelir. Bu cümlede ise birini fazla umutlandırmak istemediğini belirtir."
  },
  {
    "word": "I can tell you put a lot of thought into this paper.",
    "definition": "An expression used to show that someone clearly made a strong effort or was very thoughtful while preparing something.",
    "examples": [
      "I can tell you put a lot of thought into this paper. It's well-organized and insightful.",
      "She smiled and said, 'I can tell you put a lot of thought into your gift.'"
    ],
    "notes": "Birinin yaptığı işe çok emek ve dikkat verdiğini belirtmek için kullanılır. 'put a lot of thought into' ifadesi, 'üzerinde çok düşünmek, özen göstermek' anlamına gelir."
  },
  {
    "word": "abandon",
    "definition": "To leave behind or give up completely.",
    "examples": [
      "He had to abandon the car in the snow.",
      "They abandoned the plan due to budget issues."
    ],
    "notes": "Often used in formal/legal contexts."
  },
  {
    "word": "benevolent",
    "definition": "Well meaning and kindly.",
    "examples": [
      "She was a benevolent old lady who loved children."
    ],
    "notes": "Positive connotation."
  },
  {
    "word": "coerce",
    "definition": "To force someone to do something by using threats.",
    "examples": [
      "He was coerced into signing the contract."
    ],
    "notes": "Used especially in legal or political contexts."
  },
  {
    "word": "transcend",
    "definition": "To go beyond the limits of something.",
    "examples": [
      "Her music transcends cultural boundaries.",
      "He tried to transcend his difficulties through meditation."
    ],
    "notes": "Bir şeyin sınırlarını aşmak, üstüne çıkmak."
  },
  {
    "word": "sensory world",
    "definition": "The world experienced through the senses.",
    "examples": [
      "We live in a sensory world full of sights and sounds.",
      "Art can evoke the sensory world in vivid ways."
    ],
    "notes": "Duyu organlarıyla deneyimlenen dünya."
  },
  {
    "word": "attain",
    "definition": "To achieve or reach something after effort.",
    "examples": [
      "She attained her goals through hard work.",
      "Many athletes attain greatness through dedication."
    ],
    "notes": "Çaba sonucu ulaşmak, elde etmek."
  },
  {
    "word": "critical of",
    "definition": "Expressing disapproval or judgment.",
    "examples": [
      "The critics were critical of the new movie.",
      "He was critical of the government's policies."
    ],
    "notes": "Eleştirel olmak, bir şeyi beğenmemek."
  },
  {
    "word": "conformity",
    "definition": "Behaving according to accepted standards or rules.",
    "examples": [
      "She refused to follow social conformity.",
      "Conformity can limit personal creativity."
    ],
    "notes": "Toplumun ya da grubun kurallarına uyma."
  },
  {
    "word": "art that stressed emotion over cold",
    "definition": "Art emphasizing feelings rather than logic or reason.",
    "examples": [
      "Romantic art stressed emotion over cold rationality.",
      "The painting reflects art that stressed emotion over cold techniques."
    ],
    "notes": "Mantıktan çok duyguyu ön plana çıkaran sanat."
  },
  {
    "word": "follow in someone's footsteps",
    "definition": "To do the same things as someone before you, especially as a career.",
    "examples": [
      "He followed in his father’s footsteps and became a doctor.",
      "Many athletes follow in the footsteps of their idols."
    ],
    "notes": "Birinin izinden gitmek, onun yaptığını yapmak."
  },
  {
    "word": "Harvard Divinity School",
    "definition": "A theological seminary of Harvard University.",
    "examples": [
      "Emerson studied at Harvard Divinity School.",
      "Many religious leaders graduated from Harvard Divinity School."
    ],
    "notes": "Harvard Üniversitesi'nin ilahiyat fakültesi."
  },
  {
    "word": "clergy",
    "definition": "People ordained for religious duties, especially in Christian churches.",
    "examples": [
      "The clergy led the Sunday service.",
      "Many members of the clergy attended the conference."
    ],
    "notes": "Din görevlileri, ruhban sınıfı."
  },
  {
    "word": "spirituality",
    "definition": "Concern with the human spirit or soul rather than material things.",
    "examples": [
      "She practices meditation to deepen her spirituality.",
      "Spirituality can bring peace and purpose."
    ],
    "notes": "Maneviyat, ruhsal yön."
  },
  {
    "word": "bustling",
    "definition": "Full of energetic and noisy activity.",
    "examples": [
      "The bustling city streets were crowded with people.",
      "We enjoyed the bustling market atmosphere."
    ],
    "notes": "Canlı, hareketli ve gürültülü."
  },
  {
    "word": "urge",
    "definition": "To strongly encourage or persuade someone to do something.",
    "examples": [
      "The teacher urged the students to study harder.",
      "They urged him to accept the job offer."
    ],
    "notes": "İkna etmek, ısrarla tavsiye etmek."
  },
  {
    "word": "overpower",
    "definition": "To defeat or overcome with superior force.",
    "examples": [
      "The army was able to overpower the enemy.",
      "Fear can sometimes overpower reason."
    ],
    "notes": "Güçle yenmek, baskın çıkmak."
  },
  {
    "word": "strike a chord",
    "definition": "To cause someone to feel sympathy or emotion.",
    "examples": [
      "Her story struck a chord with many listeners.",
      "The film struck a chord with audiences worldwide."
    ],
    "notes": "Birinin duygularına dokunmak."
  },
  {
    "word": "drawn",
    "definition": "Attracted or pulled towards something.",
    "examples": [
      "Many writers were drawn to transcendentalism.",
      "She felt drawn to the city’s vibrant culture."
    ],
    "notes": "Çekilmek, ilgi duymak."
  },
  {
    "word": "to permeate",
    "definition": "To spread throughout something.",
    "examples": [
      "The smell of coffee permeated the room.",
      "Ideas of freedom began to permeate the society."
    ],
    "notes": "Bir şeye yayılmak, nüfuz etmek."
  },
  {
    "word": "attracted to",
    "definition": "Having a liking or interest towards something or someone.",
    "examples": [
      "Many were attracted to Emerson’s ideas.",
      "She was attracted to his kindness."
    ],
    "notes": "Bir şeye veya kişiye ilgi duymak."
  },
  {
    "word": "disgust over",
    "definition": "Strong feeling of dislike or disapproval.",
    "examples": [
      "He expressed disgust over the unfair treatment.",
      "There was public disgust over the corruption scandal."
    ],
    "notes": "Tiksinti, hoşlanmama."
  },
  {
    "word": "prominence",
    "definition": "The state of being important or famous.",
    "examples": [
      "Margaret Fuller came to prominence as a leading transcendentalist.",
      "The artist gained prominence after the exhibition."
    ],
    "notes": "Öne çıkma, ün kazanma."
  },
  {
    "word": "towering intellect",
    "definition": "A person with very great intelligence.",
    "examples": [
      "He was regarded as a towering intellect in philosophy.",
      "Her towering intellect inspired many students."
    ],
    "notes": "Yüksek zeka, üstün akıl."
  },
  {
    "word": "compulsive",
    "definition": "Resulting from an irresistible urge.",
    "examples": [
      "He has a compulsive habit of checking his phone.",
      "Compulsive behaviors can be hard to control."
    ],
    "notes": "Kontrol edilemeyen dürtüsel."
  },
  {
    "word": "tale",
    "definition": "A story, often one that is imaginative or traditional.",
    "examples": [
      "The old man told a fascinating tale.",
      "Fairy tales often have magical creatures."
    ],
    "notes": "Masal, hikaye."
  },
  {
    "word": "single-minded quest",
    "definition": "A very focused and determined search or mission.",
    "examples": [
      "Captain Ahab’s single-minded quest was to kill the white whale.",
      "Her single-minded quest for success inspired everyone."
    ],
    "notes": "Tek amaçlı, kararlı arayış."
  },
{
    "word": "fertile",
    "definition": "Capable of producing abundant vegetation or crops.",
    "examples": [
      "The region has fertile soil ideal for farming.",
      "Fertile lands produce higher crop yields."
    ],
    "notes": "Verimli, ürün vermeye elverişli (toprak için)."
  },
  {
    "word": "crops",
    "definition": "Plants that are grown for food or other agricultural purposes.",
    "examples": [
      "Farmers harvest their crops in the fall.",
      "Rice and wheat are common staple crops."
    ],
    "notes": "Tarım ürünleri, ekin."
  },
  {
    "word": "cropland",
    "definition": "Land used to grow crops.",
    "examples": [
      "Much of the region’s cropland is irrigated.",
      "Cropland is shrinking due to urban expansion."
    ],
    "notes": "Tarla, ekili arazi."
  },
  {
    "word": "ill-suited",
    "definition": "Not appropriate or fitting for a particular purpose or situation.",
    "examples": [
      "This dry land is ill-suited for rice farming.",
      "His personality was ill-suited to leadership."
    ],
    "notes": "Uygun olmayan, elverişsiz."
  },
  {
    "word": "thrive",
    "definition": "To grow or develop well or vigorously.",
    "examples": [
      "Plants thrive in a nutrient-rich environment.",
      "Some businesses thrive even in tough economic times."
    ],
    "notes": "Gelişmek, serpilmek, başarılı olmak."
  },
  {
    "word": "the nutrient solution flows constantly past the roots of the plants",
    "definition": "A method in which liquid nutrients continuously move around plant roots.",
    "examples": [
      "In hydroponics, the nutrient solution flows constantly past the roots of the plants.",
      "This system ensures that the plants receive oxygen and nutrients at all times."
    ],
    "notes": "Besin çözeltisi sürekli olarak bitki köklerinin etrafında dolaşır."
  },
  {
    "word": "distilled water",
    "definition": "Purified water that has been boiled into vapor and condensed back into liquid.",
    "examples": [
      "They used distilled water in the hydroponic system.",
      "Distilled water is free from minerals and impurities."
    ],
    "notes": "Damıtılmış, saf su."
  },
  {
    "word": "facilities can be located in or near cities",
    "definition": "Farming or production centers can be placed close to urban areas.",
    "examples": [
      "Hydroponic facilities can be located in or near cities to reduce transportation costs.",
      "Urban farms are facilities located near city centers."
    ],
    "notes": "Tesisler şehir içinde veya yakınında konumlandırılabilir."
  },
  {
    "word": "farmers can grow crops",
    "definition": "Farmers have the ability to cultivate food plants.",
    "examples": [
      "With hydroponics, farmers can grow crops year-round.",
      "Farmers can grow crops indoors without soil."
    ],
    "notes": "Çiftçiler ürün yetiştirebilir."
  },
  {
    "word": "herbs and vegetables",
    "definition": "Types of edible plants used for flavor or nutrition.",
    "examples": [
      "They grow fresh herbs and vegetables in their backyard.",
      "Hydroponics is ideal for growing herbs and vegetables like basil and lettuce."
    ],
    "notes": "Otlar ve sebzeler."
  },
  {
    "word": "staple crops",
    "definition": "Basic food crops that are grown in large quantities and form the main part of a diet.",
    "examples": [
      "Wheat, rice, and corn are staple crops around the world.",
      "Staple crops provide most of the population’s calories."
    ],
    "notes": "Temel gıda ürünleri."
  },
  {
    "word": "cultivation",
    "definition": "The process of growing plants for food or other uses.",
    "examples": [
      "Soil preparation is essential for successful cultivation.",
      "The cultivation of tomatoes has increased in recent years."
    ],
    "notes": "Tarım, ekim-dikim."
  },
  {
    "word": "vital",
    "definition": "Absolutely necessary or essential.",
    "examples": [
      "Clean water is vital for plant growth.",
      "It is vital to follow safety procedures in the lab."
    ],
    "notes": "Hayati, çok önemli."
  },
  {
    "word": "nutrient-rich water",
    "definition": "Water that contains essential nutrients for plant growth.",
    "examples": [
      "Hydroponic systems use nutrient-rich water instead of soil.",
      "The plants absorb minerals from the nutrient-rich water."
    ],
    "notes": "Besin maddeleri açısından zengin su."
  }
]
