[
  {
	"word": "intestines",
	"definition": "The long tube in the digestive system where food is digested further and nutrients are absorbed, consisting of the small intestine and large intestine.",
	"examples": [
	  "The small intestines absorb most of the nutrients from food.",
	  "The large intestines absorb water and form solid waste.",
	  "Stomach pain can sometimes be caused by problems in the intestines."
    ],
    "notes": "Bağırsaklar; ince bağırsak ve kalın bağırsaktan oluşur, sindirim ve emilim görevini üstlenir."
  },
  {
    "word": "joint",
    "definition": "A point where two or more bones meet in the body, allowing movement and flexibility.",
    "examples": [
      "The knee is the largest joint in the human body.",
      "Regular exercise helps keep your joints healthy.",
      "He injured the joint in his shoulder."
    ],
    "notes": "Eklemler; kemiklerin birleştiği ve hareket etmesini sağlayan yapılar."
  },
  {
    "word": "contract muscles",
    "definition": "The action of muscles becoming shorter and tighter to produce movement.",
    "examples": [
      "When you lift a weight, your arm muscles contract.",
      "The heart contracts to pump blood.",
      "She could feel her leg muscles contract as she climbed the stairs.",
	  "You contract your skeletal muscles to move the bones of your skeleton"
    ],
    "notes": "Kasların kasılması; hareket için kas liflerinin kısalıp gerilmesi."
  },
  {
    "word": "relax muscles",
    "definition": "The action of muscles becoming loose or less tense after contraction.",
    "examples": [
      "After exercise, it’s important to relax your muscles.",
      "Breathing deeply can help relax tense muscles.",
      "Massage therapy helps relax muscles and reduce stress."
    ],
    "notes": "Kasların gevşemesi; kasılmanın ardından kasların eski haline dönmesi."
  },
  {
    "word": "gland",
    "definition": "An organ in the body that produces and releases substances such as hormones or other chemicals.",
    "examples": [
      "The salivary glands produce saliva.",
      "Sweat glands help regulate body temperature.",
      "The thyroid gland controls metabolism."
    ],
    "notes": "Bez; vücutta salgı üreten organ."
  },
  {
    "word": "secrete",
    "definition": "To produce and release a substance, especially from a gland or cell.",
    "examples": [
      "Salivary glands secrete saliva to help digest food.",
      "The pancreas secretes insulin.",
      "Some plants secrete a sticky substance to trap insects."
    ],
    "notes": "Salgılamak; özellikle bezler aracılığıyla sıvı ya da kimyasal madde üretmek."
  },
  {
    "word": "propel",
    "definition": "To push or drive something forward with force.",
    "examples": [
      "The engine propels the boat through the water.",
      "Strong winds propelled the ship forward.",
      "Muscle contractions propel food through the digestive tract."
    ],
    "notes": "İtmek, ileri doğru hareket ettirmek."
  },
  {
    "word": "digestive tract",
    "definition": "The series of organs in the body that work together to digest food, from the mouth to the anus.",
    "examples": [
      "The digestive tract includes the stomach and intestines.",
      "Food moves through the digestive tract via muscle contractions.",
      "A healthy diet supports the proper functioning of the digestive tract."
    ],
    "notes": "Sindirim sistemi; ağızdan anüse kadar uzanan, besinleri işleyen organlar zinciri."
  },
  {
    "word": "inversion (grammar)",
    "definition": "A grammatical construction in which the normal order of words is reversed, typically by placing the verb before the subject. It is often used for emphasis, questions, conditional sentences without 'if', or negative adverbs at the beginning of a sentence.",
    "examples": [
      "Never have I seen such a beautiful sunset.",
      "Had I known, I would have acted differently.",
      "Rarely does he come to the office early."
    ],
    "notes": "Türkçe: Cümlenin normal kelime dizilişinin tersine çevrilmesidir. Genellikle fiilin özneden önce gelmesi şeklinde olur. Vurgu yapmak, soru sormak, koşul cümlelerinde 'if' kullanılmadan ifade etmek veya olumsuz zarfların cümle başında yer alması durumlarında kullanılır.\n\nÖrnek açıklamaları:\n- 'Had I known, I would have acted differently.': Normalde 'If I had known' şeklindedir. Burada 'if' düşürülmüş ve fiil ile özne yer değiştirmiş, koşul cümlesi daha resmi ve vurgu yapıcı.\n- 'Rarely does he come to the office early.': Normal cümle 'He rarely comes to the office early.' Olumsuz zarf cümle başına alınmış ve yardımcı fiil ile yer değiştirmiş, vurgu artmış.\n- 'Never have I seen such a beautiful sunset.': Vurgu için fiil ve özne yer değiştirmiş."
  },
  {
    "word": "elevation",
    "definition": "The height of a place above sea level or ground level.",
    "examples": [
      "The mountain's elevation is over 3,000 meters.",
      "Cities at high elevation often have cooler temperatures."
    ],
    "notes": "Türkçe: Yükselti, deniz seviyesinden ya da zemin seviyesinden yükseklik."
  },
  {
    "word": "genuine",
    "definition": "Real and exactly what it appears to be; sincere.",
    "examples": [
      "Her smile was genuine and warm.",
      "The signature on the document is genuine."
    ],
    "notes": "Türkçe: gerçek, samimi."
  },
  {
    "word": "ingenuity",
    "definition": "The ability to solve problems in clever new ways.",
    "examples": [
      "The project showed remarkable ingenuity.",
      "Her ingenuity saved the company thousands of dollars."
    ],
    "notes": "Türkçe: yaratıcılık, ustalık."
  },
  {
    "word": "edifice",
    "definition": "A large, impressive building.",
    "examples": [
      "The old edifice stood at the center of the city.",
      "They restored the historic edifice to its original glory."
    ],
    "notes": "Türkçe: büyük ve gösterişli bina."
  },
  {
    "word": "metropolis",
    "definition": "A very large and important city.",
    "examples": [
      "New York is a bustling metropolis.",
      "Ancient Rome was the metropolis of its empire."
    ],
    "notes": "Türkçe: metropol, büyük şehir."
  },
  {
    "word": "foresightedness",
    "definition": "The ability to predict and plan for the future.",
    "examples": [
      "Her foresightedness helped the company avoid bankruptcy.",
      "Good leaders are known for their foresightedness."
    ],
    "notes": "Türkçe: ileri görüşlülük."
  },
  {
    "word": "circumstance",
    "definition": "A fact or condition connected with an event or action.",
    "examples": [
      "Under no circumstance should you open that door.",
      "They were victims of circumstance."
    ],
    "notes": "Türkçe: durum, koşul."
  },
  {
    "word": "circumstantially",
    "definition": "In a way that relates to particular situations or conditions.",
    "examples": [
      "He was circumstantially involved in the case.",
      "Circumstantially, it seemed like a good decision."
    ],
    "notes": "Türkçe: koşullara bağlı olarak, durum gereği."
  },
  {
    "word": "predominant vs dominant",
    "definition": "Predominant: most frequent or common; having more influence. Dominant: having power and control over others.",
    "examples": [
      "English is the predominant language in the country.",
      "The dominant team won the championship easily."
    ],
    "notes": "Türkçe: 'predominant' = baskın, en yaygın; 'dominant' = egemen, üstün."
  },
  {
    "word": "edge",
    "definition": "An advantage over others.",
    "examples": [
      "Their potential gave the city a competitive edge over its neighbors.",
      "Experience gives older workers an edge in the job market."
    ],
    "notes": "Türkçe: avantaj, üstünlük."
  },
  {
    "word": "in demand",
    "definition": "Wanted by many people.",
    "examples": [
      "Skilled workers are in demand.",
      "That brand is always in demand."
    ],
    "notes": "Türkçe: talep gören."
  },
  {
    "word": "flourish",
    "definition": "To grow or develop successfully.",
    "examples": [
      "Business is flourishing in the city center.",
      "Plants flourish in this climate."
    ],
    "notes": "Türkçe: gelişmek, büyümek."
  },
  {
    "word": "commodity",
    "definition": "A product or raw material that can be bought and sold.",
    "examples": [
      "Oil is a valuable commodity.",
      "Coffee is one of the country's main commodities."
    ],
    "notes": "Türkçe: ticari mal, emtia."
  },
  {
    "word": "exotic goods",
    "definition": "Products that are unusual or from foreign countries.",
    "examples": [
      "The market was filled with exotic goods.",
      "They imported exotic goods from Asia."
    ],
    "notes": "Türkçe: egzotik mallar."
  },
  {
    "word": "coerce",
    "definition": "To make someone do something by force or threat.",
    "examples": [
      "They coerced him into signing the contract.",
      "She was coerced to confess."
    ],
    "notes": "Türkçe: zorlamak, baskı yapmak."
  },
  {
    "word": "irrigation works",
    "definition": "Structures or systems used to supply water to land or crops.",
    "examples": [
      "The farmers built new irrigation works.",
      "Ancient civilizations depended on irrigation works for farming."
    ],
    "notes": "Türkçe: sulama sistemleri."
  },
  {
    "word": "prosperous",
    "definition": "Successful and wealthy.",
    "examples": [
      "They live in a prosperous neighborhood.",
      "A prosperous economy benefits everyone."
    ],
    "notes": "Türkçe: refah içinde, zengin."
  },
  {
    "word": "prosperity",
    "definition": "The state of being successful and wealthy.",
    "examples": [
      "The country enjoyed years of prosperity.",
      "Education is key to prosperity."
    ],
    "notes": "Türkçe: refah, zenginlik."
  },
  {
    "word": "lowlands",
    "definition": "Areas of land that are low in elevation.",
    "examples": [
      "The lowlands are prone to flooding.",
      "Rice grows well in the lowlands."
    ],
    "notes": "Türkçe: alçak araziler."
  },
  {
    "word": "highlands",
    "definition": "Areas of land that are high in elevation.",
    "examples": [
      "The highlands are cooler than the coast.",
      "Sheep farming is common in the highlands."
    ],
    "notes": "Türkçe: yüksek araziler."
  },
  {
    "word": "gulf",
    "definition": "A large difference between two people, groups, or things; also a large area of sea partly surrounded by land.",
    "examples": [
      "There is a wide gulf between rich and poor.",
      "The Gulf of Mexico is a large body of water."
    ],
    "notes": "Türkçe: körfez; büyük fark."
  },
  {
    "word": "fabric",
    "definition": "Cloth produced by weaving or knitting textile fibers.",
    "examples": [
      "This dress is made from soft cotton fabric.",
      "The fabric of the tent is waterproof."
    ],
    "notes": "Türkçe: Kumaş, dokuma. Ayrıca soyut anlamda ‘yapı, temel’ anlamında da kullanılır (the fabric of society → toplumun yapısı)."
  },
  {
    "word": "artisan",
    "definition": "A worker skilled in a craft, especially one involving making things by hand.",
    "examples": [
      "The artisan crafted a beautiful wooden table.",
      "Local artisans sell handmade jewelry at the market."
    ],
    "notes": "Türkçe: Zanaatkâr, el işlerinde usta kişi."
  },
  {
    "word": "port",
    "definition": "A town or city with a harbor where ships load or unload goods.",
    "examples": [
      "The ship docked at the port early in the morning.",
      "Singapore is one of the busiest ports in the world."
    ],
    "notes": "Türkçe: Liman kenti. 'Harbor' ise limanın kendisi, güvenli su alanıdır."
  },
  {
    "word": "harbor",
    "definition": "A sheltered area of water where ships can anchor safely.",
    "examples": [
      "The boats returned to the harbor before the storm.",
      "The natural harbor provided protection for the fishing fleet."
    ],
    "notes": "Türkçe: Liman, sığınak. Fiziksel olarak gemilerin barındığı yer."
  },
  {
	"word": "rise in ... from ...",
	"definition": "To go upward from a source or starting point, in a particular shape, form, or manner.",
	"examples": [
	  "The cliffs rose in sheer walls from the sea.",
	  "Smoke rose in thick columns from the burning building."
	],
	"notes": "Türkçe: '-den/-dan ... halinde yükselmek'. 'from' çıkış kaynağını, 'in' ise yükselme şeklini belirtir."
  },
  {
    "word": "evade",
    "definition": "To escape or avoid something, especially by cleverness or trickery.",
    "examples": [
      "The thief evaded capture by hiding in the crowd.",
      "She evaded his questions about her past."
    ],
    "notes": "Türkçe: Kaçmak, atlatmak, (sorudan) kaçınmak."
  },
  {
    "word": "jar",
    "definition": "A cylindrical container, typically made of glass or clay, with a wide mouth.",
    "examples": [
      "She opened a jar of honey.",
      "The shelf was filled with jars of jam."
    ],
    "notes": "Türkçe: Kavanoz, küp."
  },
  {
    "word": "intricate",
    "definition": "Very detailed and complicated.",
    "examples": [
      "The artist created an intricate pattern on the vase.",
      "The watch’s intricate design fascinated the engineer."
    ],
    "notes": "Türkçe: Karmaşık, detaylı, ince işçilikli."
  },
  {
    "word": "parade",
    "definition": "A public procession, often to celebrate an event.",
    "examples": [
      "The city held a parade to celebrate the holiday.",
      "Soldiers marched in the military parade."
    ],
    "notes": "Türkçe: Geçit töreni, alay."
  },
  {
    "word": "dispose",
    "definition": "To get rid of something by throwing it away.",
    "examples": [
      "Please dispose of your trash properly.",
      "Hazardous waste must be disposed of carefully."
    ],
    "notes": "Türkçe: Elden çıkarmak, atmak."
  },
  {
    "word": "imperfections",
    "definition": "Small faults, flaws, or defects that make something less than perfect.",
    "examples": [
      "The craftsman carefully inspected the vase for any imperfections.",
      "Minor imperfections in the fabric made it unsuitable for sale."
    ],
    "notes": "Türkçe: Kusurlar, hatalar, eksiklikler."
  },
  {
    "word": "wares",
    "definition": "Items or goods that are for sale.",
    "examples": [
      "The street vendor displayed his wares on a blanket.",
      "Artisans come to the market to sell their wares."
    ],
    "notes": "Türkçe: Mallar, satılık eşyalar."
  },
  {
    "word": "vessels",
    "definition": "Containers used to hold liquids; or ships and large boats.",
    "examples": [
      "The museum displayed ancient clay vessels.",
      "Several fishing vessels were anchored in the harbor."
    ],
    "notes": "Türkçe: Kap, kap-kacak; gemi, tekne."
  },
  {
    "word": "sheer",
    "definition": "Used to emphasize the large amount, size, or degree of something; or meaning very steep or almost vertical.",
    "examples": [
      "The sheer size of the mountain was overwhelming.",
      "The cliffs rose in sheer walls from the sea."
    ],
    "notes": "Türkçe: Sırf, tamamen; dik, sarp."
  },
  {
    "word": "elusive",
    "definition": "Difficult to find, catch, or achieve; hard to understand or define.",
    "examples": [
      "The elusive criminal evaded capture for years.",
      "True happiness can be elusive."
    ],
    "notes": "Türkçe: Zor bulunan, yakalanması veya tanımlanması güç."
  },
  {
    "word": "substantial",
    "definition": "Large in amount, size, or importance.",
    "examples": [
      "The company made a substantial profit last year.",
      "There is substantial evidence to support the claim."
    ],
    "notes": "Türkçe: Önemli ölçüde, büyük, sağlam."
  },
  {
    "word": "amphorae",
    "definition": "Plural form of amphora: tall ancient Greek or Roman jars with two handles and a narrow neck, used to store and transport goods such as oil, wine, and grain.",
    "examples": [
      "Archaeologists discovered several amphorae buried under the sand.",
      "The amphorae were once filled with olive oil transported across the Mediterranean."
    ],
    "notes": "Türkçe: Amphora (tekil), amphorae (çoğul); antik çağlarda özellikle Akdeniz ticaretinde kullanılan iki kulplu dar boyunlu çömlekler. Gemilerde genellikle ambarlarda sıralanır ve sıvı ya da kuru mallar taşınırdı."
  },
  {
    "word": "amphora",
    "definition": "A tall ancient Greek or Roman jar with two handles and a narrow neck, used to store and transport goods such as oil, wine, and grain.",
    "examples": [
      "The amphora was decorated with intricate patterns.",
      "An amphora of wine was placed on the merchant's ship."
    ],
    "notes": "Türkçe: İki kulplu, dar boyunlu antik çömlek; özellikle antik deniz ticaretinde şarap, zeytinyağı ve tahıl taşımak için kullanılırdı. Gemilerde istiflenmesi kolay olacak şekilde tasarlanırdı."
  },
  {
    "word": "might of state",
    "definition": "The power, strength, or force of a nation or government.",
    "examples": [
      "The might of state was displayed in the grand military parade.",
      "Small countries often struggle against the might of state."
    ],
    "notes": "Türkçe: Devletin gücü, otoritesi."
  },
  {
    "word": "dump",
    "definition": "To get rid of something by dropping or throwing it away, often in a careless way; or a place where waste is disposed of.",
    "examples": [
      "Factories are not allowed to dump toxic waste into the river.",
      "The old furniture was taken to the dump."
    ],
    "notes": "Türkçe: Atmak, boşaltmak; çöplük."
  },
  {
    "word": "discard on delivery",
    "definition": "To throw away or dispose of something immediately upon receiving it.",
    "examples": [
      "The damaged goods were discarded on delivery.",
      "They decided to discard on delivery any items that were not up to standard."
    ],
    "notes": "Türkçe: Teslim alındığında hemen atmak/elden çıkarmak."
  },
  {
    "word": "fit",
    "definition": "To be the right size or shape for someone or something; or to equip, install, or provide with something.",
    "examples": [
      "These shoes don’t fit me.",
      "They fitted a new lock on the door.",
      "The horse was fitted with a leather harness."
    ],
    "notes": "Türkçe: 1) Sığmak, uymak. 2) Takmak, monte etmek, donatmak. İngiliz İngilizcesinde 'fitted' formu donatma anlamında yaygındır."
  },
  {
    "word": "abundant",
    "definition": "Existing in large quantities; more than enough.",
    "examples": [
      "The forest is abundant with wildlife.",
      "There is abundant evidence to support the claim."
    ],
    "notes": "Bol, çok."
  },
  {
    "word": "apparent",
    "definition": "Clearly visible or understood; obvious.",
    "examples": [
      "It became apparent that she was lying.",
      "The solution to the problem was not immediately apparent."
    ],
    "notes": "Açık, belli."
  },
  {
    "word": "to attribute",
    "definition": "To regard something as being caused by someone or something.",
    "examples": [
      "She attributes her success to hard work.",
      "The painting was attributed to a famous artist."
    ],
    "notes": "Bağlamak, atfetmek."
  },
  {
    "word": "to cease",
    "definition": "To stop doing something or to come to an end.",
    "examples": [
      "The factory ceased operations last year.",
      "They never cease to amaze me."
    ],
    "notes": "Durmak, durdurmak."
  },
  {
    "word": "cohesive",
    "definition": "Forming a united whole; sticking together.",
    "examples": [
      "The team worked in a cohesive manner.",
      "Good writing needs cohesive paragraphs."
    ],
    "notes": "Uyumlu, bütünleşmiş."
  },
  {
    "word": "endure",
    "definition": "To suffer patiently; to last or continue over time.",
    "examples": [
      "They had to endure many hardships during the journey.",
      "This tradition has endured for centuries."
    ],
    "notes": "Dayanmak, katlanmak; sürmek."
  },
  {
    "word": "erode",
    "definition": "To wear away gradually, usually by wind, water, or other natural agents.",
    "examples": [
      "The river has eroded the banks over time.",
      "Strong waves eroded the coastline."
    ],
    "notes": "Aşındırmak, erozyona uğratmak."
  },
  {
    "word": "harness",
    "definition": "Verb: to control and make use of (natural resources). Noun: a set of straps and fittings for fastening or controlling something.",
    "examples": [
      "They harnessed the power of the wind to generate electricity.",
      "The horse was fitted with a leather harness."
    ],
    "notes": "Kullanmak (enerji vb.), koşum takımı."
  },
  {
    "word": "orchid mantis",
    "definition": "A type of praying mantis that resembles an orchid flower.",
    "examples": [
      "The orchid mantis uses its flower-like appearance to camouflage.",
      "Orchid mantises are fascinating insects found in tropical forests."
    ],
    "notes": "Orkide peygamberdevesi; orkide çiçeğine benzeyen bir böcek türü."
  },
  {
    "word": "petals",
    "definition": "The colorful parts of a flower that surround the reproductive organs.",
    "examples": [
      "The rose petals are soft and fragrant.",
      "She collected the petals to make potpourri."
    ],
    "notes": "Çiçek taçyaprakları."
  },
  {
    "word": "paw vs claw",
    "definition": "Paw: the foot of an animal with pads and usually claws. Claw: a sharp curved nail on the foot of an animal.",
    "examples": [
      "The cat’s paw is soft but has sharp claws.",
      "Birds use their claws to grip branches."
    ],
    "notes": "Paw: hayvanın yumuşak tabanlı ayağı. Claw: pençenin keskin tırnağı."
  },
  {
    "word": "arid shrubland",
    "definition": "A dry region dominated by shrubs and little rainfall.",
    "examples": [
      "Cacti are common plants in arid shrublands.",
      "Arid shrublands have adapted plants that survive with little water."
    ],
    "notes": "Kurak çalılık alan."
  },
  {
    "word": "shrub",
    "definition": "A small to medium-sized woody plant.",
    "examples": [
      "The garden is full of flowering shrubs.",
      "Shrubs provide shelter for many animals."
    ],
    "notes": "Çalı, küçük odunsu bitki."
  },
  {
    "word": "up my sleeve",
    "definition": "Having a secret plan or idea.",
    "examples": [
      "Don’t worry, I have a trick up my sleeve.",
      "She always has something up her sleeve for surprises."
    ],
    "notes": "Sürpriz ya da gizli plan anlamında kullanılan deyim."
  },
  {
    "word": "move on to sth",
    "definition": "To start doing or discussing something new.",
    "examples": [
      "After the break, we moved on to the next topic.",
      "Let's move on to the next chapter in the book."
    ],
    "notes": "Bir şeye geçmek, devam etmek."
  },
  {
    "word": "swamp",
    "definition": "A wetland area with waterlogged soil and dense vegetation.",
    "examples": [
      "The swamp is home to many unique animals.",
      "They hiked through the swamp despite the muddy conditions."
    ],
    "notes": "Bataklık."
  },
  {
    "word": "moss",
    "definition": "A small green plant that grows in moist shady areas.",
    "examples": [
      "Moss covers the rocks near the waterfall.",
      "The forest floor was soft with moss."
    ],
    "notes": "Yosun."
  },
  {
    "word": "shall we",
    "definition": "A polite suggestion or offer to do something together.",
    "examples": [
      "Shall we go for a walk?",
      "Shall we start the meeting now?"
    ],
    "notes": "Birlikte bir şey yapmayı önerme ifadesi."
  },
  {
    "word": "haul",
    "definition": "Verb: to pull or drag something heavy. Noun: the amount of something transported.",
    "examples": [
      "They hauled the boat out of the water.",
      "The fishermen brought in a large haul of fish."
    ],
    "notes": "Taşımak, çekmek (fiil); taşınan miktar (isim)."
  },
  {
    "word": "steep",
    "definition": "Having a sharp slope; rising or falling sharply.",
    "examples": [
      "The hikers climbed a steep hill.",
      "Be careful, the road is very steep here."
    ],
    "notes": "Dik, sarp."
  },
  {
    "word": "flat-topped",
    "definition": "Having a flat surface at the top.",
    "examples": [
      "The mountain has a flat-topped summit.",
      "Flat-topped tables are easier to work on."
    ],
    "notes": "Düz tepeli, üstü düz."
  },
  {
    "word": "sparse",
    "definition": "Thinly scattered or distributed; not dense.",
    "examples": [
      "Vegetation in the desert is sparse.",
      "The forest had sparse trees in some areas."
    ],
    "notes": "Seyrek, az."
  },
  {
    "word": "vegetation",
    "definition": "Plants considered collectively, especially in a particular area.",
    "examples": [
      "The mountain has dense vegetation.",
      "Vegetation in the tundra is limited."
    ],
    "notes": "Bitki örtüsü."
  },
  {
    "word": "So do I",
    "definition": "Used to agree with a positive statement.",
    "examples": [
      "I like coffee. – So do I.",
      "She enjoys reading. – So do I."
    ],
    "notes": "Ben de (olumlu cümleye katılma)."
  },
  {
    "word": "Neither do I",
    "definition": "Used to agree with a negative statement.",
    "examples": [
      "I don’t like spinach. – Neither do I.",
      "He can’t swim. – Neither do I."
    ],
    "notes": "Ben de (olumsuz cümleye katılma)."
  },
  {
    "word": "stinger",
    "definition": "A sharp pointed organ of some insects used for defense or attack.",
    "examples": [
      "The bee uses its stinger to protect itself.",
      "Be careful of the scorpion’s stinger."
    ],
    "notes": "Diken, sokma organı."
  },
  {
    "word": "shabby",
    "definition": "In poor condition through long use or lack of care.",
    "examples": [
      "He wore a shabby old coat.",
      "The house looked shabby and neglected."
    ],
    "notes": "Eski püskü, yıpranmış."
  },
  {
    "word": "tweezers",
    "definition": "A small tool used for picking up small objects or pulling hairs.",
    "examples": [
      "She used tweezers to remove a splinter.",
      "Tweezers are useful for detailed work."
    ],
    "notes": "Cımbız."
  },
  {
    "word": "scissors",
    "definition": "A tool used for cutting paper, cloth, etc., consisting of two blades.",
    "examples": [
      "Cut the paper with scissors.",
      "The scissors are on the desk."
    ],
    "notes": "Makas."
  },
  {
    "word": "centipede",
    "definition": "A long, many-legged arthropod.",
    "examples": [
      "Centipedes can move very quickly.",
      "Some centipedes have venomous bites."
    ],
    "notes": "Kırkayak."
  },
  {
    "word": "enclosure",
    "definition": "An area that is sealed off with barriers.",
    "examples": [
      "The animals were kept in a secure enclosure.",
      "They built an enclosure for the garden."
    ],
    "notes": "Çit veya duvarla çevrili alan."
  },
  {
    "word": "spacious",
    "definition": "Having ample space; roomy.",
    "examples": [
      "The house has a spacious living room.",
      "The office was bright and spacious."
    ],
    "notes": "Geniş, ferah."
  },
  {
    "word": "cockroach",
    "definition": "A common insect known for surviving in harsh conditions.",
    "examples": [
      "Cockroaches are found in many homes.",
      "They can be difficult to get rid of cockroaches."
    ],
    "notes": "Hamam böceği."
  },
  {
    "word": "grab on",
    "definition": "To seize or hold something tightly.",
    "examples": [
      "Grab on to the rope to avoid falling.",
      "The child grabbed on to his mother’s hand."
    ],
    "notes": "Sıkıca tutunmak."
  },
  {
    "word": "railing",
    "definition": "A barrier made of rails, usually for safety.",
    "examples": [
      "Hold the railing while going down the stairs.",
      "The balcony has a metal railing."
    ],
    "notes": "Korkuluk."
  },
  {
    "word": "Arctic",
    "definition": "Relating to the region around the North Pole.",
    "examples": [
      "Polar bears live in the Arctic.",
      "The Arctic climate is extremely cold."
    ],
    "notes": "Kuzey Kutbu bölgesi."
  },
  {
    "word": "medieval",
    "definition": "Relating to the Middle Ages, roughly from the 5th to the late 15th century.",
    "examples": [
      "The castle is a fine example of medieval architecture.",
      "Medieval knights followed a strict code of honor."
    ],
    "notes": "Orta Çağ'a ait; İngilizce telaffuz /ˌmediˈiːvəl/ veya /ˌmiːdɪˈiːvəl/."
  },
  {
    "word": "porous",
    "definition": "Having small holes that allow liquids or air to pass through.",
    "examples": [
      "Sandstone is a porous rock that can hold water.",
      "The sponge’s porous surface absorbs water easily."
    ],
    "notes": "Gözenekli; geçirimli."
  },
  {
    "word": "cattle",
    "definition": "Large domesticated animals such as cows and bulls, kept on a farm for milk or meat. Always plural in form.",
    "examples": [
      "The cattle are grazing in the field.",
      "Farmers keep cattle for milk production."
    ],
    "notes": "Her zaman çoğul kullanılır; 'a cattle' denmez."
  },
  {
    "word": "expend",
    "definition": "To use up energy, resources, or time for a specific purpose.",
    "examples": [
      "You should not expend all your energy at once.",
      "The project has expended a lot of financial resources."
    ],
    "notes": "Harcamak, tüketmek."
  },
  {
    "word": "barnacle",
    "definition": "A small marine animal that attaches itself permanently to surfaces like rocks, ships, or shells.",
    "examples": [
      "The ship’s hull was covered in barnacles.",
      "Barnacles attach themselves to whales."
    ],
    "notes": "Deniz canlısı; gemi gövdelerine ve kayalara yapışır."
  },
  {
    "word": "nutrient-rich",
    "definition": "Containing a large amount of essential nutrients.",
    "examples": [
      "Spinach is a nutrient-rich vegetable.",
      "The soil here is nutrient-rich and ideal for farming."
    ],
    "notes": "Besin açısından zengin."
  },
  {
    "word": "indifferent",
    "definition": "Having no particular interest or sympathy; unconcerned.",
    "examples": [
      "She was indifferent to their problems.",
      "He seemed indifferent about the outcome."
    ],
    "notes": "Umursamaz, ilgisiz."
  },
  {
    "word": "tomb",
    "definition": "A large grave, often an impressive stone structure, for burying the dead.",
    "examples": [
      "The tomb of the ancient king was discovered by archaeologists.",
      "They visited the tomb of the poet."
    ],
    "notes": "Mezar, türbe."
  },
  {
    "word": "pottery",
    "definition": "Objects made of clay and hardened by heat.",
    "examples": [
      "The museum has a fine collection of ancient pottery.",
      "She studied pottery making for three years."
    ],
    "notes": "Çanak çömlek, seramik."
  },
  {
    "word": "relic",
    "definition": "An object surviving from an earlier time, often of historical or cultural value.",
    "examples": [
      "The old sword is a relic from the medieval period.",
      "The ruins are relics of a once-great empire."
    ],
    "notes": "Tarihi eser, kalıntı."
  },
  {
    "word": "moisture vs humidity",
    "definition": "Moisture: small amounts of water present in a substance or the air; Humidity: the amount of water vapor in the air.",
    "examples": [
      "Wipe off any moisture before painting.",
      "The humidity in the room made it uncomfortable."
    ],
    "notes": "Moisture: nem (genel olarak su miktarı); Humidity: havadaki nem oranı."
  },
  {
    "word": "sponge",
    "definition": "A soft, porous material used for cleaning or absorbing liquid.",
    "examples": [
      "She used a sponge to wash the dishes.",
      "Sea sponges are animals that live on the ocean floor."
    ],
    "notes": "Sünger."
  },
  {
    "word": "limit students to sth",
    "definition": "To restrict students so that they only do or have a certain thing.",
    "examples": [
      "The teacher limited students to two questions each.",
      "The program limits students to using school equipment only."
    ],
    "notes": "Öğrencilerin yalnızca belirli bir şeyle sınırlanmasını sağlamak."
  },
  {
    "word": "account for real needs",
    "definition": "To take into consideration the actual requirements of something or someone.",
    "examples": [
      "The budget should account for real needs, not just estimates.",
      "The plan must account for real needs of the community."
    ],
    "notes": "Gerçek ihtiyaçları göz önünde bulundurmak."
  },
  {
    "word": "bacteria vs bacterium",
    "definition": "Bacterium: singular form; Bacteria: plural form of microscopic single-celled organisms.",
    "examples": [
      "One bacterium can multiply quickly in the right conditions.",
      "Bacteria are found everywhere in nature."
    ],
    "notes": "Bacterium: tekil; Bacteria: çoğul."
  },
  {
    "word": "intact",
    "definition": "Remaining whole, undamaged, or unbroken.",
    "examples": [
      "The ancient vase was found intact.",
      "Despite the storm, the building remained intact."
    ],
    "notes": "Hasarsız, bozulmamış."
  },
  {
    "word": "Mediterranean Sea",
    "definition": "A large sea bordered by Europe, Asia, and Africa.",
    "examples": [
      "Italy is surrounded by the Mediterranean Sea on three sides.",
      "The Mediterranean Sea is known for its clear blue water."
    ],
    "notes": "Akdeniz."
  },
  {
    "word": "shipwreck",
    "definition": "The destruction or sinking of a ship.",
    "examples": [
      "They found treasure in a centuries-old shipwreck.",
      "The shipwreck was caused by a powerful storm."
    ],
    "notes": "Gemi enkazı."
  },
  {
    "word": "wreck",
    "definition": "A vehicle, ship, or building that has been destroyed or badly damaged.",
    "examples": [
      "The car was a total wreck after the accident.",
      "Divers explored the wreck of an old warship."
    ],
    "notes": "Enkaz; ayrıca fiil olarak 'harap etmek' anlamında."
  },
  {
    "word": "to wage a war/campaign",
    "definition": "To carry out or engage in a war or campaign actively.",
    "examples": [
      "The country decided to wage a war against terrorism.",
      "They waged a campaign to raise awareness about climate change."
    ],
    "notes": "Bir savaşı veya kampanyayı aktif şekilde yürütmek anlamında kullanılır."
  },
  {
    "word": "windowsill",
    "definition": "The flat ledge at the bottom of a window.",
    "examples": [
      "She placed the flower pot on the windowsill.",
      "The cat loves to sit on the windowsill and watch outside."
    ],
    "notes": "Pencere pervazı, pencerenin altındaki düz yüzey."
  },
  {
    "word": "stop at nothing",
    "definition": "To do anything necessary to achieve a goal, no matter the cost.",
    "examples": [
      "He stopped at nothing to get the promotion.",
      "They will stop at nothing to win the championship."
    ],
    "notes": "Bir hedefe ulaşmak için hiçbir şeyden geri durmamak, her şeyi yapmak."
  },
  {
    "word": "quest",
    "definition": "A long or difficult search for something.",
    "examples": [
      "The knight went on a quest to find the lost treasure.",
      "She is on a quest to discover the truth."
    ],
    "notes": "Uzun ve zorlu bir arayış ya da görev."
  },
  {
    "word": "grind - ground - ground",
    "definition": "To crush something into small pieces or powder by rubbing or pressing.",
    "examples": [
      "They grind and crush the seed into bread.",
      "He ground the coffee beans fresh every morning."
    ],
    "notes": "Bir şeyi öğütmek, ezmek anlamında kullanılır."
  },
  {
    "word": "to overrun",
    "definition": "To spread over or occupy a place quickly and in large numbers.",
    "examples": [
      "The colony was overrun by ants.",
      "The weeds overran the garden in just a few weeks."
    ],
    "notes": "Bir yeri hızla ve kalabalık bir şekilde istila etmek, kaplamak."
  },
  {
    "word": "make a run for it",
    "definition": "To try to escape quickly.",
    "examples": [
      "When the police arrived, the thief made a run for it.",
      "They saw the danger and made a run for it."
    ],
    "notes": "Hızlıca kaçmaya çalışmak."
  },
  {
    "word": "colony turns not to flee but to fight",
    "definition": "The colony decides not to run away but to defend itself by fighting.",
    "examples": [
      "When attacked, the colony turns not to flee but to fight.",
      "Instead of escaping, the colony turned to fight their enemies."
    ],
    "notes": "'Turns' burada 'decides' veya 'changes behavior' anlamında kullanılmıştır."
  },
  {
    "word": "rally",
    "definition": "To come together for a common purpose, especially to support or help someone.",
    "examples": [
      "The ants rallied to their queen during the attack.",
      "Fans rallied behind their team during the final match."
    ],
    "notes": "Bir araya gelmek, destek vermek ya da güç birliği yapmak."
  },
  {
    "word": "breach",
    "definition": "To break through a barrier or surface.",
    "examples": [
      "They breached the surface and the enemy was on the run.",
      "The army breached the city walls after a long siege."
    ],
    "notes": "Engeli, bariyeri aşmak veya kırmak."
  },
  {
    "word": "commentary",
    "definition": "A spoken or written explanation or discussion about an event, situation, or work.",
    "examples": [
      "The news program offered commentary on the recent election.",
      "His book includes a detailed commentary on the historical context."
    ],
    "notes": "Açıklama, yorum anlamındadır. Genellikle olaylara, metinlere veya durumlara dair değerlendirme ya da analiz sunar. Spor karşılaşmalarında da 'live commentary' (canlı anlatım) olarak kullanılır."
  },
  {
    "word": "engage in",
    "definition": "To take part in or become involved in an activity.",
    "examples": [
      "The students actively engaged in the classroom discussion.",
      "She rarely engages in political debates."
    ],
    "notes": "Bir faaliyete katılmak, dahil olmak anlamındadır. Genellikle resmi ya da akademik bağlamlarda kullanılır. Örnek: 'engage in conversation', 'engage in research', 'engage in illegal activities'."
  },
  {
    "word": "mere",
    "definition": "Used to emphasize how small or insignificant something is.",
    "examples": [
      "The mere thought of it makes me nervous.",
      "He lost the match by a mere two points."
    ],
    "notes": "Sadece, yalnızca anlamına gelir. Küçük ya da önemsiz bir şeyi vurgulamak için kullanılır."
  },
  {
    "word": "collective reflection",
    "definition": "The shared process of thinking deeply or carefully about something as a group.",
    "examples": [
      "The memorial encouraged collective reflection on the tragedy.",
      "The class engaged in collective reflection after the group project."
    ],
    "notes": "Bir topluluğun birlikte düşünmesi veya değerlendirme sürecidir. Genellikle sosyal ya da duygusal konular için kullanılır."
  },
  {
    "word": "transcends linguistic barriers",
    "definition": "Goes beyond the limitations of language; can be understood without words.",
    "examples": [
      "Music often transcends linguistic barriers and connects people worldwide.",
      "His artwork transcends linguistic barriers, communicating emotions universally."
    ],
    "notes": "Dil engellerini aşmak, dil farkı olmadan anlaşılabilir olmak anlamındadır."
  },
  {
    "word": "resonate with people",
    "definition": "To have a deep emotional or meaningful impact on someone.",
    "examples": [
      "Her story resonated with people around the world.",
      "The movie’s message truly resonated with the audience."
    ],
    "notes": "İnsanlarda güçlü bir duygu uyandırmak, onların deneyimleriyle ya da değerleriyle örtüşmek anlamındadır."
  },
  {
    "word": "foster",
    "definition": "To encourage the development or growth of something (such as ideas or relationships).",
    "examples": [
      "The school aims to foster creativity among students.",
      "Open communication fosters trust in relationships."
    ],
    "notes": "Teşvik etmek, büyütmek, geliştirmek anlamındadır. Fiziksel değil, soyut şeyler (düşünce, ilişki, gelişim) için kullanılır."
  },
  {
    "word": "evoke",
    "definition": "To bring a feeling, memory, or image into someone's mind.",
    "examples": [
      "The smell of pine evoked memories of his childhood.",
      "The painting evokes a sense of peace and nostalgia."
    ],
    "notes": "Anı, duygu ya da tepki uyandırmak anlamındadır. Genellikle sanatsal ya da duygusal bağlamlarda kullanılır."
  },
  {
    "word": "compliance",
    "definition": "The act of obeying rules, laws, or requests.",
    "examples": [
      "The company was fined for not being in compliance with environmental regulations.",
      "Wearing a seatbelt is a matter of legal compliance."
    ],
    "notes": "Uyum sağlama, kurallara/kanunlara itaat etme anlamındadır. 'In compliance with' kalıbı sıkça kullanılır."
  },
  {
    "word": "incentivize",
    "definition": "To encourage someone to do something by offering a reward or benefit.",
    "examples": [
      "The government wants to incentivize companies to reduce emissions.",
      "They offered bonuses to incentivize employees to meet their targets."
    ],
    "notes": "Teşvik etmek anlamındadır. Genellikle ekonomik ya da motivasyonel ödüllerle desteklenir."
  },
  {
    "word": "vessels",
    "definition": "Large boats or ships used for transporting goods or people.",
    "examples": [
      "Fishing vessels were spotted near the coast.",
      "Oil was transported in massive cargo vessels."
    ],
    "notes": "Gemi, tekne anlamındadır. 'Vessel' kelimesi tıpta damar anlamına da gelir (blood vessel), ama burada denizcilik anlamı kullanılmıştır."
  },
  {
    "word": "loopholes",
    "definition": "Gaps or ambiguities in laws or rules that allow people to avoid obeying them.",
    "examples": [
      "Companies often exploit tax loopholes to avoid paying taxes.",
      "The new law was written carefully to close existing legal loopholes."
    ],
    "notes": "Yasal boşluk, kuralda açıklık. Bu boşluklar genelde kötü niyetli amaçlarla kullanılır."
  },
  {
    "word": "shrimp trawling",
    "definition": "A fishing method that uses large nets to catch shrimp, often dragging the nets along the seafloor.",
    "examples": [
      "Shrimp trawling can cause damage to ocean ecosystems.",
      "Regulations now limit where shrimp trawling can occur."
    ],
    "notes": "Karides avcılığı için deniz tabanına büyük ağların çekilmesi yöntemi. Sıklıkla çevresel etkileri nedeniyle eleştirilir."
  },
  {
    "word": "tilt",
    "definition": "To move or cause something to move into a sloping position.",
    "examples": [
      "He tilted his head to one side.",
      "The table began to tilt under the weight."
    ],
    "notes": "Eğilmek, eğmek anlamına gelir. Hem fiziksel eğim hem de mecazi olarak (örneğin 'the balance tilted in their favor') kullanılabilir."
  },
  {
    "word": "humidity",
    "definition": "The amount of moisture (water vapor) in the air.",
    "examples": [
      "The humidity in the jungle made it hard to breathe.",
      "High humidity levels can make hot temperatures feel even hotter."
    ],
    "notes": "Nem, özellikle havadaki su buharı oranı anlamına gelir. ‘High humidity’ → yüksek nem; ‘low humidity’ → düşük nem."
  },
  {
    "word": "deteriorate",
    "definition": "To become worse over time; to decline in condition, quality, or function.",
    "examples": [
      "The patient’s health began to deteriorate rapidly.",
      "The building has deteriorated due to years of neglect."
    ],
    "notes": "Kötüleşmek, bozulmak, zamanla değerini veya işlevini yitirmek anlamındadır. Genellikle sağlık, hava durumu, ilişkiler veya yapılar gibi şeyler için kullanılır."
  },
  {
    "word": "to rust",
    "definition": "To become covered with rust (a reddish-brown substance that forms on iron or steel when exposed to water and air).",
    "examples": [
      "If you leave the bike out in the rain, it will rust.",
      "The old tools had rusted after years of neglect."
    ],
    "notes": "Demirin su ve hava ile tepkimesinden kaynaklanan paslanma anlamında kullanılır."
  },
  {
    "word": "grow mold",
    "definition": "To develop a fungal growth on a surface, often due to damp or humid conditions.",
    "examples": [
      "Bread can grow mold if it’s left out for too long.",
      "The walls started to grow mold because of the water leak."
    ],
    "notes": "'Grow mold' → küflenmek. Nemli ve havalandırılmayan ortamlarda ortaya çıkar."
  },
  {
    "word": "brittle vs. fragile",
    "definition": "Both mean 'easily broken,' but 'brittle' refers to things that break or shatter without bending, while 'fragile' refers to things that are delicate and easily damaged.",
    "examples": [
      "The glass was fragile, so I wrapped it carefully.",
      "The dry twig was so brittle it snapped in half."
    ],
    "notes": "'Brittle': Sert ama kolayca kırılan. 'Fragile': Hassas, narin, dikkatli taşınması gereken. İkisi de kırılganlık ifade eder ama bağlamları farklıdır."
  },
  {
    "word": "phenomenon",
    "definition": "Something that happens or exists, especially something that is unusual or difficult to understand.",
    "examples": [
      "The Northern Lights are a natural phenomenon that attracts tourists every year.",
      "Global warming is a complex environmental phenomenon."
    ],
    "notes": "Olağan dışı ya da dikkat çeken olay/durum. Tekil kullanımı 'phenomenon', çoğul hali 'phenomena'dır."
  },
  {
    "word": "vouch",
    "definition": "To say that something is true based on your personal experience or knowledge; to support or confirm someone's character or claim.",
    "examples": [
      "I can vouch for his honesty — I’ve worked with him for years.",
      "She vouched that the product really works."
    ],
    "notes": "Bir kişinin güvenilirliğini ya da bir bilginin doğruluğunu şahsi deneyimle onaylamak, kefil olmak anlamındadır. Genellikle 'vouch for someone/something' şeklinde kullanılır."
  },
  {
    "word": "better off",
    "definition": "In a more favorable or improved condition, especially when comparing situations.",
    "examples": [
      "You are better off having a few close friends than many shallow ones.",
      "After quitting his stressful job, he was much better off."
    ],
    "notes": "\"Daha iyi durumda olmak\" anlamında kullanılır. Genellikle 'be' fiili ile birlikte ('is better off', 'are better off') kullanılır. ✅ 'You are better off having a few friends.' ⛔ 'Having a few friends is better off' → gramatik olarak doğru değildir."
  },
  {
    "word": "but for",
    "definition": "If it were not for; except for — used to say that something would have happened if a particular thing had not prevented it.",
    "examples": [
      "But for the rain, we would have gone hiking.",
      "She would have passed the exam but for a small mistake."
    ],
    "notes": "\"Eğer olmasaydı\", \"... olmazsa\" anlamında kullanılır. Bir şeyin gerçekleşmesini engelleyen durumları belirtir."
  },
  {
    "word": "bask",
    "definition": "To lie or relax in a pleasant warmth (usually sunlight).",
    "examples": [
      "The lizard basked in the afternoon sun.",
      "They basked in the warm glow of the campfire."
    ],
    "notes": "Güneşin veya sıcaklığın tadını çıkarmak, keyifle uzanmak."
  },
  {
    "word": "cling to sth",
    "definition": "To hold onto something tightly or not want to let go of something (physically or emotionally).",
    "examples": [
      "The child clung to his mother’s hand in the crowd.",
      "Many people still cling to old traditions."
    ],
    "notes": "Bir şeye sıkıca tutunmak ya da duygusal olarak bağlı kalmak."
  },
  {
    "word": "mate",
    "definition": "To pair or come together for reproduction (used for animals).",
    "examples": [
      "Birds often mate during the spring season.",
      "The frogs mate in the pond every year."
    ],
    "notes": "Eşleşmek, çiftleşmek (hayvanlar için)."
  },
  {
    "word": "climb over",
    "definition": "To go over something by climbing.",
    "examples": [
      "The child climbed over the fence to get into the garden.",
      "He climbed over the wall to retrieve the ball."
    ],
    "notes": "Üzerinden tırmanarak geçmek."
  },
  {
    "word": "crab",
    "definition": "A sea creature with a flat body, pincers, and sideways walk.",
    "examples": [
      "The crab scuttled across the beach.",
      "Crabs use their pincers to defend themselves."
    ],
    "notes": "Yengeç."
  },
  {
    "word": "outgrow",
    "definition": "To grow too big for something (like clothes or a habit).",
    "examples": [
      "Children often outgrow their clothes quickly.",
      "She outgrew her fear of the dark."
    ],
    "notes": "Bir şey için fazla büyümek ya da alışkanlığı bırakmak."
  },
  {
    "word": "The storm coated the tank in a thin red sand",
    "definition": "The storm covered the tank with a thin layer of red sand.",
    "examples": [
      "After the storm, the car was coated in dust.",
      "The storm coated the tank in a thin red sand."
    ],
    "notes": "Fırtına, tankı ince kırmızı kum tabakasıyla kapladı."
  },
  {
    "word": "ravine",
    "definition": "A deep, narrow gorge with steep sides.",
    "examples": [
      "The hikers crossed the ravine using a wooden bridge.",
      "Water flowed rapidly through the ravine after the rain."
    ],
    "notes": "Dar ve derin vadi, uçurum."
  },
  {
    "word": "gecko",
    "definition": "A small lizard known for its sticky feet and ability to climb walls.",
    "examples": [
      "The gecko clung to the wall effortlessly.",
      "Geckos are common in tropical regions."
    ],
    "notes": "Duvarlara tırmanabilen küçük kertenkele."
  },
  {
    "word": "lizard",
    "definition": "A reptile with scaly skin, movable eyelids, and usually four legs.",
    "examples": [
      "The lizard basked in the sun on the rock.",
      "Many lizards can regenerate their tails."
    ],
    "notes": "Kertenkele."
  },
  {
    "word": "chameleon",
    "definition": "A lizard that can change its color to blend into surroundings.",
    "examples": [
      "The chameleon changed color to match the leaves.",
      "Chameleons use their color change for camouflage."
    ],
    "notes": "Rengini değiştirebilen kertenkele."
  },
  {
    "word": "have sth on hand",
    "definition": "To have something available or ready to use.",
    "examples": [
      "Make sure you have extra batteries on hand.",
      "I always have a first aid kit on hand."
    ],
    "notes": "Bir şeyi hazır veya elde bulundurmak."
  },
  {
    "word": "wait out",
    "definition": "To stay in place until a difficult or unpleasant situation ends.",
    "examples": [
      "They waited out the storm inside the cabin.",
      "We waited out the traffic jam by listening to music."
    ],
    "notes": "Bir durum geçene kadar beklemek."
  },
  {
    "word": "monsoon",
    "definition": "A seasonal heavy rain, especially in South and Southeast Asia.",
    "examples": [
      "The monsoon brought heavy rains to the region.",
      "Farmers depend on the monsoon for their crops."
    ],
    "notes": "Muson; yoğun mevsimlik yağmur."
  },
  {
    "word": "grain of sand",
    "definition": "A tiny particle of sand.",
    "examples": [
      "A single grain of sand can be sharp.",
      "The beach was covered in millions of grains of sand."
    ],
    "notes": "Bir kum tanesi."
  },
  {
    "word": "clutch of eggs",
    "definition": "A group of eggs laid by a bird or reptile at one time.",
    "examples": [
      "The mother bird guarded her clutch of eggs.",
      "A clutch of turtle eggs was found on the beach."
    ],
    "notes": "Yumurtalar grubu, kümelenmiş yumurtalar."
  },
  {
    "word": "decay",
    "definition": "To rot or decompose over time.",
    "examples": [
      "The fallen leaves began to decay on the forest floor.",
      "Teeth can decay without proper care."
    ],
    "notes": "Çürümek, bozulmak."
  },
  {
    "word": "bone marrow",
    "definition": "Soft tissue inside bones that produces blood cells.",
    "examples": [
      "Bone marrow is essential for producing new blood cells.",
      "Doctors can transplant bone marrow to treat diseases."
    ],
    "notes": "Kemik iliği."
  },
  {
    "word": "coyote",
    "definition": "A wild animal similar to a small wolf found in North America.",
    "examples": [
      "Coyotes are known for their howling at night.",
      "The coyote scavenged near the campsite."
    ],
    "notes": "Kurt benzeri bir yırtıcı, Kuzey Amerika’da yaşayan."
  },
  {
    "word": "hive",
    "definition": "A structure where bees live and produce honey.",
    "examples": [
      "The bees returned to their hive after collecting nectar.",
      "The hive was buzzing with activity."
    ],
    "notes": "Arı kovanı."
  },
  {
    "word": "to swarm",
    "definition": "To move or gather in a large group, especially insects.",
    "examples": [
      "Bees swarmed around the hive.",
      "Locusts swarmed the crops, causing damage."
    ],
    "notes": "Sürü halinde hareket etmek, toplanmak."
  },
  {
    "word": "come head to head",
    "definition": "To meet in direct conflict or competition.",
    "examples": [
      "The two teams came head to head in the final match.",
      "The rivals came head to head over the business deal."
    ],
    "notes": "Direkt karşılaşmak, çatışmak."
  },
  {
    "word": "muster up",
    "definition": "To gather or summon up (courage, strength, etc.).",
    "examples": [
      "She mustered up the courage to speak in public.",
      "He mustered up all his energy to finish the race."
    ],
    "notes": "Toplamak, güç ya da cesaret biriktirmek."
  },
  {
    "word": "dig out",
    "definition": "To remove something by digging.",
    "examples": [
      "They dug out the buried treasure.",
      "The dog dug out a hole in the yard."
    ],
    "notes": "Kazıp çıkarmak."
  },
  {
    "word": "sanctuary",
    "definition": "A safe place or refuge.",
    "examples": [
      "The forest serves as a sanctuary for many animals.",
      "The refugees found sanctuary in the camp."
    ],
    "notes": "Sığınak, korunaklı yer."
  },
  {
    "word": "to coat",
    "definition": "To cover something with a layer of material.",
    "examples": [
      "The leaves were coated with morning dew.",
      "The cake was coated with chocolate."
    ],
    "notes": "Kaplamak, bir şeyle örtmek."
  },
  {
    "word": "resilient ecosystem",
    "definition": "An ecosystem that can recover quickly from disturbances or changes.",
    "examples": [
      "The forest is a resilient ecosystem that bounces back after fires.",
      "Resilient ecosystems are important for maintaining biodiversity."
    ],
    "notes": "Dayanıklı, çabuk toparlanan ekosistem."
  },
  {
    "word": "to be doomed to die",
    "definition": "Certain or destined to die.",
    "examples": [
      "Many species are doomed to die due to habitat loss.",
      "Without water, the plants were doomed to die."
    ],
    "notes": "Ölümü kesin, kaderinde ölmek."
  },
  {
    "word": "razor sharp spines",
    "definition": "Spines that are extremely sharp, like a razor blade.",
    "examples": [
      "The cactus has razor sharp spines to protect itself.",
      "Be careful of the razor sharp spines on this plant."
    ],
    "notes": "Jilet gibi keskin dikenler."
  },
  {
    "word": "sap",
    "definition": "The fluid that circulates through a plant, carrying nutrients.",
    "examples": [
      "Maple trees produce sweet sap used for syrup.",
      "The sap flows through the branches."
    ],
    "notes": "Bitkilerdeki özsu, özsu akışı."
  },
  {
    "word": "group up",
    "definition": "To come together to form a group.",
    "examples": [
      "The animals group up for protection.",
      "Students grouped up to work on the project."
    ],
    "notes": "Bir araya gelmek, grup oluşturmak."
  },
  {
    "word": "monumental moment",
    "definition": "An extremely important or historic moment.",
    "examples": [
      "Graduation day was a monumental moment in her life.",
      "The discovery marked a monumental moment in science."
    ],
    "notes": "Anlamlı, çok önemli an."
  },
  {
    "word": "angle their backs high into the air",
    "definition": "To position their backs at a steep angle upwards.",
    "examples": [
      "The birds angled their backs high into the air before flying.",
      "The cat angled its back high when it felt threatened."
    ],
    "notes": "Sırtlarını havaya doğru kaldırmak."
  },
  {
    "word": "water droplets",
    "definition": "Small drops of water.",
    "examples": [
      "Water droplets formed on the leaves after rain.",
      "She wiped the water droplets from the window."
    ],
    "notes": "Su damlacıkları."
  },
  {
    "word": "drip down",
    "definition": "To fall in drops downward.",
    "examples": [
      "Water dripped down the glass.",
      "Rain dripped down from the roof."
    ],
    "notes": "Damlamak, aşağı doğru damlamak."
  },
  {
    "word": "drip from",
    "definition": "To fall in drops from a specific place.",
    "examples": [
      "Water was dripping from the faucet.",
      "Sap dripped from the tree."
    ],
    "notes": "Bir yerden damlamak."
  },
  {
    "word": "subjunctive mood",
    "definition": "A verb form used to express demands, suggestions, wishes, or necessities, often following verbs like 'demand', 'suggest', or 'insist'. In passive constructions, it uses 'be' + past participle.",
    "examples": [
      "They demand that the telescope be placed in the best possible site.",
      "She insists that he be here on time.",
      "We suggest that he go to the doctor."
    ],
    "notes": "İngilizcede gereklilik, istek veya öneri ifade etmek için kullanılır. Passive yapıda 'be' + geçmiş zaman fiili (past participle) şeklindedir."
  },
  {
    "word": "observatory",
    "definition": "A place or building equipped for observing astronomical events.",
    "examples": [
      "The observatory has a large telescope for stargazing.",
      "Scientists made important discoveries at the observatory."
    ],
    "notes": "Gözlemevi, astronomi için kullanılan yer."
  },
  {
    "word": "to peer into",
    "definition": "To look carefully or with difficulty at something.",
    "examples": [
      "Astronomers peer into the galaxy through powerful telescopes.",
      "She peered into the dark room to see what was inside."
    ],
    "notes": "Dikkatle bakmak, gözlemek."
  },
  {
    "word": "vital",
    "definition": "Extremely important or necessary for life.",
    "examples": [
      "Water is vital for all living organisms.",
      "It's vital to get enough sleep every night."
    ],
    "notes": "Hayati, çok önemli."
  },
  {
    "word": "water vapor",
    "definition": "Water in the form of gas, present in the air.",
    "examples": [
      "Water vapor rises from the ocean surface.",
      "The air was thick with water vapor after the rain."
    ],
    "notes": "Su buharı."
  },
  {
    "word": "altitude",
    "definition": "The height of an object or place above sea level.",
    "examples": [
      "Mount Everest has a high altitude.",
      "Air pressure decreases with altitude."
    ],
    "notes": "Rakım, yükseklik."
  },
  {
    "word": "refracting",
    "definition": "Bending of light as it passes through a medium.",
    "examples": [
      "Refracting telescopes use lenses to bend light.",
      "Light refracting through a prism creates a rainbow."
    ],
    "notes": "Kırma (ışığın yön değiştirmesi)."
  },
  {
    "word": "devise",
    "definition": "To plan or invent a method or solution.",
    "examples": [
      "Scientists devised a new experiment.",
      "They devised a strategy to solve the problem."
    ],
    "notes": "Tasarlamak, planlamak."
  },
  {
    "word": "distort",
    "definition": "To change the shape, appearance, or sound of something in a way that is not natural or true.",
    "examples": [
      "The image was distorted on the screen.",
      "Noise can distort the sound quality."
    ],
    "notes": "Bozmak, çarpıtmak."
  },
  {
    "word": "compensate",
    "definition": "To make up for something lost or damaged.",
    "examples": [
      "He compensated for his mistake by working harder.",
      "The company compensated employees for overtime."
    ],
    "notes": "Telafi etmek, karşılamak."
  },
  {
    "word": "pollinate",
    "definition": "To transfer pollen to a flower, enabling it to produce seeds.",
    "examples": [
      "Bees pollinate many types of flowers.",
      "Wind can also pollinate plants."
    ],
    "notes": "Tozlaşmak, bitkilerin döllenmesi."
  },
  {
    "word": "pollinators",
    "definition": "Animals or insects that transfer pollen from one flower to another.",
    "examples": [
      "Bees and butterflies are common pollinators.",
      "Pollinators play a key role in agriculture."
    ],
    "notes": "Tozlaştırıcılar; polen taşıyan canlılar."
  },
  {
    "word": "heirloom seeds",
    "definition": "Seeds saved and passed down through generations, often from traditional plant varieties.",
    "examples": [
      "Many gardeners prefer heirloom seeds for their unique flavors.",
      "Heirloom seeds help preserve plant diversity."
    ],
    "notes": "Atadan kalma tohumlar, geleneksel tohum çeşitleri."
  },
  {
    "word": "species",
    "definition": "A group of living organisms that can breed and produce fertile offspring.",
    "examples": [
      "The tiger is an endangered species.",
      "There are many species of birds in the forest."
    ],
    "notes": "Tür (hem tekil hem çoğul kullanılır)."
  },
  {
    "word": "dye",
    "definition": "A substance used to change the color of something, especially fabric.",
    "examples": [
      "They used natural dyes to color the fabric.",
      "The cloth was dyed bright red."
    ],
    "notes": "Boyamak için kullanılan madde; boya."
  },
  {
    "word": "dyes",
    "definition": "Plural of dye; substances used to color materials.",
    "examples": [
      "Synthetic dyes are common in the textile industry.",
      "Different dyes produce different colors."
    ],
    "notes": "Boyalar (çoğul)."
  },
  {
    "word": "advent of sth",
    "definition": "The arrival or beginning of something important.",
    "examples": [
      "The advent of the internet changed communication.",
      "With the advent of electricity, life improved greatly."
    ],
    "notes": "Bir şeyin başlangıcı, gelişi."
  },
  {
    "word": "curative (verb: cure)",
    "definition": "Having the ability to cure diseases or heal.",
    "examples": [
      "Many plants have curative properties.",
      "The medicine was curative for the infection."
    ],
    "notes": "Şifa verici, iyileştirici. Fiil hali: cure = iyileştirmek."
  },
  {
    "word": "watersheds",
    "definition": "Areas of land that separate waters flowing to different rivers or seas.",
    "examples": [
      "Watersheds are important for managing water resources.",
      "Pollution can affect entire watersheds."
    ],
    "notes": "Su havzaları."
  },
  {
    "word": "moderate (verb)",
    "definition": "To make something less extreme or intense.",
    "examples": [
      "Plantlife moderates the local climate.",
      "The government tried to moderate the effects of the crisis."
    ],
    "notes": "Dengelemek, hafifletmek, ılımlı hale getirmek."
  },
  {
    "word": "in full swing",
    "definition": "At the highest level of activity or progress.",
    "examples": [
      "The festival was in full swing by evening.",
      "Construction is now in full swing."
    ],
    "notes": "Tam gaz, en yoğun şekilde."
  },
  {
    "word": "swing",
    "definition": "To move back and forth or to change.",
    "examples": [
      "Children love to swing at the playground.",
      "Public opinion can swing quickly."
    ],
    "notes": "Sallamak, salınmak; değişmek."
  },
  {
    "word": "human encroachment into forests",
    "definition": "Humans gradually invading or taking over forest areas.",
    "examples": [
      "Human encroachment into forests threatens wildlife habitats.",
      "Deforestation is often caused by human encroachment."
    ],
    "notes": "İnsanların orman alanlarını işgal etmesi."
  },
  {
    "word": "arable",
    "definition": "Suitable for growing crops.",
    "examples": [
      "The farmers worked on arable land.",
      "Arable soil is necessary for agriculture."
    ],
    "notes": "Tarım yapılabilir, ekilebilir (toprak)."
  },
  {
    "word": "dam",
    "definition": "A barrier built to hold back water and raise its level.",
    "examples": [
      "The dam provides water for irrigation.",
      "They built a dam to control flooding."
    ],
    "notes": "Baraj."
  },
  {
    "word": "spice",
    "definition": "A substance used to add flavor to food, usually from plants.",
    "examples": [
      "Cinnamon is a common spice used in desserts.",
      "They added several spices to the stew."
    ],
    "notes": "Baharat."
  },
  {
    "word": "spicy",
    "definition": "Having a strong, hot flavor from spices.",
    "examples": [
      "This curry is very spicy.",
      "He likes spicy food."
    ],
    "notes": "Baharatlı, acı (baharat nedeniyle)."
  },
  {
    "word": "bark of bush",
    "definition": "The outer covering of the stem or trunk of a bush.",
    "examples": [
      "Some spices are made from the bark of bushes.",
      "The bark of this bush has a strong scent."
    ],
    "notes": "Çalı kabuğu (bitkinin dış kısmı)."
  },
  {
    "word": "cinnamon",
    "definition": "A spice made from the bark of certain trees, used in sweet dishes.",
    "examples": [
      "She sprinkled cinnamon on her oatmeal.",
      "Cinnamon is often used in baking."
    ],
    "notes": "Tarçın."
  },
  {
    "word": "flavor (verb)",
    "definition": "To give a particular taste to food or drink.",
    "examples": [
      "Herbs are used to flavor many dishes.",
      "The sauce was flavored with garlic and basil."
    ],
    "notes": "Tat katmak, lezzet vermek."
  },
  {
    "word": "starches",
    "definition": "Foods rich in carbohydrates, such as potatoes and grains.",
    "examples": [
      "Rice, bread, and pasta are common starches.",
      "Starches provide energy to the body."
    ],
    "notes": "Nişastalı gıdalar; karbonhidrat içeriği yüksek yiyecekler."
  },
  {
    "word": "as with sth",
    "definition": "In the same way as something else.",
    "examples": [
      "As with other grains, rice needs to be cooked before eating.",
      "As with many fruits, bananas ripen quickly."
    ],
    "notes": "Diğer ... gibi; ...'da olduğu gibi."
  },
  {
    "word": "timber",
    "definition": "Wood prepared for use in building or carpentry.",
    "examples": [
      "The house was built from local timber.",
      "They export timber to several countries."
    ],
    "notes": "Kereste, inşaatlık ağaç."
  },
  {
    "word": "pulp of coniferous trees",
    "definition": "Soft material from evergreen trees, used to make paper.",
    "examples": [
      "Paper is produced from the pulp of coniferous trees.",
      "The factory processes pulp from pine and spruce trees."
    ],
    "notes": "İğne yapraklı ağaçlardan (çam türü) elde edilen kağıt hamuru."
  },
  {
    "word": "flax",
    "definition": "A plant grown for its fiber and seeds, used in making linen and oil.",
    "examples": [
      "Flax is used to produce linen fabric.",
      "Flax seeds are a healthy source of omega-3."
    ],
    "notes": "Keten bitkisi."
  },
  {
    "word": "weave",
    "definition": "To form fabric by crossing threads over and under each other.",
    "examples": [
      "They weave fabric using traditional methods.",
      "She learned to weave baskets as a child."
    ],
    "notes": "Dokumak."
  },
  {
    "word": "wove",
    "definition": "Past tense of 'weave'.",
    "examples": [
      "She wove a beautiful scarf from fine wool.",
      "The artisan wove the cloth by hand."
    ],
    "notes": "'Weave' fiilinin geçmiş zaman hali (V2)."
  },
  {
    "word": "woven",
    "definition": "Past participle of 'weave'; made by weaving.",
    "examples": [
      "The fabric was tightly woven.",
      "They used woven materials for the tent."
    ],
    "notes": "'Weave' fiilinin üçüncü hali (V3); dokunmuş."
  },
  {
    "word": "rapeseed (canola)",
    "definition": "A plant whose seeds are used to produce canola oil.",
    "examples": [
      "Canola oil is extracted from rapeseed.",
      "Rapeseed fields turn bright yellow in spring."
    ],
    "notes": "Kolza tohumu (canola olarak da bilinir); yemeklik yağ üretiminde kullanılır."
  },
  {
    "word": "olive",
    "definition": "A small fruit used for its oil or eaten as food.",
    "examples": [
      "Olives are a major part of the Mediterranean diet.",
      "They harvested olives from the old trees."
    ],
    "notes": "Zeytin. Çoğulu: olives."
  },
  {
    "word": "livestock",
    "definition": "Farm animals raised for food or other products.",
    "examples": [
      "The farm has a large number of livestock, including cows and sheep.",
      "Livestock farming is a major part of the economy."
    ],
    "notes": "Çiftlik hayvanları (sığır, koyun, keçi gibi)."
  },
  {
    "word": "to sweeten dishes",
    "definition": "To make food taste sweet by adding sugar or another sweetener.",
    "examples": [
      "Honey is often used to sweeten dishes naturally.",
      "They sweetened the sauce with a little brown sugar."
    ],
    "notes": "Yemekleri tatlandırmak."
  },
  {
    "word": "sugarcane",
    "definition": "A tall tropical plant whose juice is a source of sugar.",
    "examples": [
      "Sugar is extracted from sugarcane and sugar beets.",
      "They grow sugarcane in tropical regions."
    ],
    "notes": "Şeker kamışı."
  },
  {
    "word": "sugar beets",
    "definition": "A root vegetable used to produce sugar, mainly in temperate regions.",
    "examples": [
      "Europe produces a lot of sugar from sugar beets.",
      "Sugar beets are harvested in the fall."
    ],
    "notes": "Şeker pancarı."
  },
  {
    "word": "infusions",
    "definition": "Drinks made by soaking herbs or other substances in hot water.",
    "examples": [
      "Herbal infusions are popular for relaxation.",
      "They served fruit infusions instead of tea."
    ],
    "notes": "Bitki çayı, demleme içecekler."
  },
  {
    "word": "herbal",
    "definition": "Made from or related to herbs.",
    "examples": [
      "She drank a cup of herbal tea before bed.",
      "Herbal remedies are used in traditional medicine."
    ],
    "notes": "Bitkisel, otlarla ilgili."
  },
  {
    "word": "coffee beans",
    "definition": "The seeds of the coffee plant, used to make coffee.",
    "examples": [
      "They ground the coffee beans for a fresh brew.",
      "Coffee beans are roasted before being packaged."
    ],
    "notes": "Kahve çekirdekleri."
  },
  {
    "word": "powdered",
    "definition": "In the form of a powder.",
    "examples": [
      "Powdered sugar is used to decorate cakes.",
      "She added powdered milk to the recipe."
    ],
    "notes": "Toz halinde, tozlaştırılmış."
  },
  {
    "word": "seed plants",
    "definition": "Plants that reproduce by producing seeds.",
    "examples": [
      "Seed plants include both flowering plants and conifers.",
      "Most of the crops we eat come from seed plants."
    ],
    "notes": "Tohumla çoğalan bitkiler."
  },
  {
    "word": "human diets",
    "definition": "The types of food people regularly eat.",
    "examples": [
      "Grains are a common part of many human diets.",
      "Human diets vary greatly between cultures."
    ],
    "notes": "İnsanların düzenli olarak yediği yiyecekler; beslenme şekli."
  },
  {
    "word": "fare",
    "definition": "The kind of food that is served or eaten.",
    "examples": [
      "Many societies eat vegetarian fare almost exclusively.",
      "The restaurant serves traditional Italian fare."
    ],
    "notes": "Yemek çeşidi; yiyecek türü (özellikle sunulan yemekler için)."
  },
  {
    "word": "exclusively",
    "definition": "Only; not including anything else.",
    "examples": [
      "Many societies eat vegetarian fare almost exclusively.",
      "This room is reserved exclusively for staff."
    ],
    "notes": "Sadece, yalnızca."
  },
  {
    "word": "crops",
    "definition": "Plants that are grown for food or profit.",
    "examples": [
      "Farmers harvested their crops before the storm.",
      "Corn and wheat are common crops."
    ],
    "notes": "Tarım ürünleri, mahsuller."
  },
  {
    "word": "nomadic",
    "definition": "Living a lifestyle of moving from place to place.",
    "examples": [
      "Nomadic tribes move in search of food and water.",
      "Before agriculture, humans were mostly nomadic."
    ],
    "notes": "Göçebe; yerleşik olmayan yaşam tarzı."
  },
  {
    "word": "horticulture",
    "definition": "The practice of growing fruits, vegetables, or flowers.",
    "examples": [
      "Horticulture became more common with early farming societies.",
      "He studied horticulture in college."
    ],
    "notes": "Bahçecilik; meyve, sebze veya süs bitkileri yetiştiriciliği."
  },
  {
    "word": "cereals",
    "definition": "Grains used for food, such as wheat, rice, or corn.",
    "examples": [
      "Cereals are a major part of the human diet.",
      "Breakfast cereals are often made from corn or oats."
    ],
    "notes": "Tahıllar; buğday, mısır gibi yiyecek için yetiştirilen taneli bitkiler."
  },
  {
    "word": "staple food",
    "definition": "A food that is eaten regularly and in large quantities.",
    "examples": [
      "Rice is a staple food in many Asian countries.",
      "Bread and potatoes are staple foods in Europe."
    ],
    "notes": "Temel gıda; düzenli olarak ve çokça tüketilen yiyecek."
  },
  {
    "word": "beans and nuts",
    "definition": "Plant-based foods rich in protein and nutrients.",
    "examples": [
      "Vegetarians often eat beans and nuts for protein.",
      "Almonds and kidney beans are examples of beans and nuts."
    ],
    "notes": "Baklagiller ve kuruyemişler; besleyici ve protein kaynağı."
  },
  {
    "word": "peanut",
    "definition": "A type of nut that grows underground and is high in protein.",
    "examples": [
      "Peanut butter is made from ground peanuts.",
      "Some people are allergic to peanuts."
    ],
    "notes": "Yer fıstığı."
  },
  {
    "word": "ample",
    "definition": "More than enough; plentiful.",
    "examples": [
      "There was ample food for everyone.",
      "She had ample time to finish the test."
    ],
    "notes": "Bol, yeterli miktarda."
  },
  {
    "word": "notion",
    "definition": "An idea, belief, or opinion.",
    "examples": [
      "He rejected the notion that money brings happiness.",
      "She had a romantic notion of life in the countryside."
    ],
    "notes": "Fikir, kavram, düşünce."
  },
  {
    "word": "sustenance",
    "definition": "Food or nourishment needed to survive.",
    "examples": [
      "They found little sustenance in the desert.",
      "Bread and water were their only sustenance."
    ],
    "notes": "Besin, yaşam kaynağı."
  },
  {
    "word": "stark",
    "definition": "Very plain, clear, or harsh in appearance or contrast.",
    "examples": [
      "The desert presented a stark landscape.",
      "There is a stark difference between the two options."
    ],
    "notes": "Çarpıcı, sert, yalın."
  },
  {
    "word": "persuade",
    "definition": "To make someone agree to do something by giving reasons.",
    "examples": [
      "She persuaded him to join the trip.",
      "Can I persuade you to stay a bit longer?"
    ],
    "notes": "İkna etmek (davranış değişikliğine odaklanır)."
  },
  {
    "word": "convince",
    "definition": "To make someone believe something is true.",
    "examples": [
      "I convinced him that it was safe.",
      "She couldn't convince them of her innocence."
    ],
    "notes": "İkna etmek (inanç/değer değişikliğine odaklanır)."
  },
  {
    "word": "strive",
    "definition": "To make a great effort to achieve something.",
    "examples": [
      "We strive to provide the best service.",
      "She always strives for perfection."
    ],
    "notes": "Çabalamak, gayret göstermek."
  },
  {
    "word": "strive diligently",
    "definition": "To work hard and carefully toward a goal.",
    "examples": [
      "He strived diligently to finish his research on time.",
      "They strived diligently to improve living conditions."
    ],
    "notes": "Gayretle, büyük çabayla çabalamak."
  },
  {
    "word": "evocative",
    "definition": "Bringing strong images or feelings to mind.",
    "examples": [
      "The poem is evocative of childhood memories.",
      "It was an evocative performance."
    ],
    "notes": "Çağrışım yapan, duyguları canlandıran."
  },
  {
    "word": "studious attention",
    "definition": "Careful and focused concentration.",
    "examples": [
      "She gave studious attention to every detail.",
      "The artist painted with studious attention."
    ],
    "notes": "Dikkatli, özenli ilgi veya odaklanma."
  },
  {
    "word": "prompt",
    "definition": "To cause or encourage someone to do something.",
    "examples": [
      "What could have prompted their studious attention to making such images?",
      "The teacher's question prompted a lively discussion."
    ],
    "notes": "Teşvik etmek, harekete geçirmek, yönlendirmek."
  },
  {
    "word": "likeness",
    "definition": "A depiction or resemblance of something.",
    "examples": [
      "The statue is a likeness of the king.",
      "The cave painting shows a clear likeness of a deer."
    ],
    "notes": "Benzetim, tasvir, suret."
  },
  {
    "word": "to confer success or luck",
    "definition": "To give or grant success or good fortune.",
    "examples": [
      "They believed the painting would confer luck in the hunt.",
      "Wearing the charm was said to confer success."
    ],
    "notes": "Şans ya da başarı getirmek."
  },
  {
    "word": "nourishment",
    "definition": "Food or anything that provides energy or health.",
    "examples": [
      "The baby needs proper nourishment.",
      "The soup provided warmth and nourishment."
    ],
    "notes": "Besin, besleyici şeyler."
  },
  {
    "word": "sheer joy",
    "definition": "Pure, intense happiness.",
    "examples": [
      "They danced out of sheer joy.",
      "The child screamed with sheer joy when he saw the gift."
    ],
    "notes": "Tam anlamıyla, saf mutluluk."
  },
  {
    "word": "delight",
    "definition": "A feeling of great pleasure or satisfaction.",
    "examples": [
      "The children squealed in delight.",
      "It was a delight to hear her sing."
    ],
    "notes": "Zevk, neşe, büyük mutluluk."
  },
  {
    "word": "imitation",
    "definition": "The act of copying someone or something.",
    "examples": [
      "Parrots are known for their imitation of human speech.",
      "The painting was an imitation of a famous work."
    ],
    "notes": "Taklit, benzetme."
  },
  {
    "word": "triumph",
    "definition": "A great victory or achievement.",
    "examples": [
      "Winning the championship was a major triumph.",
      "The team celebrated their triumph over adversity."
    ],
    "notes": "Zafer, büyük başarı."
  },
  {
    "word": "a certain appeal",
    "definition": "A particular attraction or charm.",
    "examples": [
      "The old town has a certain appeal.",
      "His unusual style had a certain appeal to young audiences."
    ],
    "notes": "Kendine has bir çekicilik, cazibe."
  },
  {
    "word": "handiwork",
    "definition": "Work done skillfully by hand.",
    "examples": [
      "The embroidery is her handiwork.",
      "We admired the artist’s handiwork on the sculpture."
    ],
    "notes": "El emeği, ustalık işi."
  },
  {
    "word": "plausibly",
    "definition": "In a way that seems reasonable or probable.",
    "examples": [
      "He plausibly explained his absence.",
      "The theory was plausibly argued by the scientist."
    ],
    "notes": "Mantıklı bir şekilde, akla yatkın biçimde."
  },
  {
    "word": "proliferation",
    "definition": "A rapid increase in the number or amount of something.",
    "examples": [
      "There has been a proliferation of smartphones in recent years.",
      "The proliferation of fake news is concerning."
    ],
    "notes": "Hızlı artış, çoğalma."
  },
  {
    "word": "innumerable",
    "definition": "Too many to be counted.",
    "examples": [
      "There are innumerable stars in the sky.",
      "She has faced innumerable challenges."
    ],
    "notes": "Sayısız, çok fazla."
  },
  {
    "word": "repertoire",
    "definition": "All the things a person is able to do or perform.",
    "examples": [
      "The singer added new songs to her repertoire.",
      "He has a wide repertoire of cooking techniques."
    ],
    "notes": "Repertuvar; bir kişinin yapabildiği tüm şeyler."
  },
  {
    "word": "recur",
    "definition": "To happen again or repeatedly.",
    "examples": [
      "The same problem keeps recurring.",
      "Headaches may recur after stress."
    ],
    "notes": "Tekrar etmek, yeniden meydana gelmek."
  },
  {
    "word": "accorded to the animals",
    "definition": "Given or granted to animals.",
    "examples": [
      "Respect was accorded to the animals in the ritual.",
      "Certain rights are accorded to endangered species."
    ],
    "notes": "Hayvanlara tanınan/verilen (saygı, hak vb.)."
  },
  {
    "word": "incidence of sth",
    "definition": "The frequency or rate of something happening.",
    "examples": [
      "There has been a high incidence of flu this year.",
      "The incidence of car accidents has dropped."
    ],
    "notes": "Bir şeyin meydana gelme sıklığı."
  },
  {
    "word": "spectacular grotto",
    "definition": "A very impressive natural cave.",
    "examples": [
      "We explored a spectacular grotto near the coast.",
      "The painting was discovered inside a spectacular grotto."
    ],
    "notes": "Muhteşem mağara."
  },
  {
    "word": "daub",
    "definition": "To paint or smear carelessly.",
    "examples": [
      "Figures were daubed on the cave walls.",
      "The child daubed paint on the paper."
    ],
    "notes": "Gelişigüzel boyamak, sürmek."
  },
  {
    "word": "conceivably",
    "definition": "Possibly; it can be imagined.",
    "examples": [
      "Conceivably, they might have migrated from the north.",
      "This could conceivably lead to a new discovery."
    ],
    "notes": "Muhtemelen, akla gelebilecek şekilde."
  },
  {
    "word": "conceive",
    "definition": "To imagine or form an idea; to create.",
    "examples": [
      "She couldn't conceive of a world without art.",
      "The plan was conceived by a group of engineers."
    ],
    "notes": "Tasarlamak, hayal etmek, düşünmek."
  },
  {
    "word": "recesses",
    "definition": "Inner, hidden parts of a space.",
    "examples": [
      "He searched the dark recesses of the cave.",
      "Memories hidden in the recesses of her mind."
    ],
    "notes": "Kuytu köşe, iç kısımlar."
  },
  {
    "word": "penetrate",
    "definition": "To go through or enter something, especially with force.",
    "examples": [
      "Light couldn't penetrate the thick fog.",
      "The bullet penetrated the wall."
    ],
    "notes": "Nüfuz etmek, içine girmek, delip geçmek."
  },
  {
    "word": "nooks and crannies",
    "definition": "Small hidden or hard-to-reach parts of a space.",
    "examples": [
      "The house has many nooks and crannies.",
      "She searched every nook and cranny for her keys."
    ],
    "notes": "Köşe bucak, en gizli yerler."
  },
  {
    "word": "claws",
    "definition": "Sharp, curved nails found on the feet of some animals.",
    "examples": [
      "The crab used its claws to defend itself.",
      "The eagle's claws are strong and sharp."
    ],
    "notes": "Pençe, kıskaç (hayvanlarda)."
  },
  {
    "word": "venomous sting",
    "definition": "A painful and poisonous wound caused by an animal like a scorpion or wasp.",
    "examples": [
      "The scorpion delivered a venomous sting to its prey.",
      "Some jellyfish have a venomous sting that can harm humans."
    ],
    "notes": "Zehirli iğne/dokunuş. Genellikle böcek ve deniz canlıları için kullanılır."
  },
  {
    "word": "sting",
    "definition": "To pierce the skin with a sharp point, causing pain or injury.",
    "examples": [
      "Bees sting when they feel threatened.",
      "I was stung by a wasp yesterday."
    ],
    "notes": "Fiil hâli: 'to sting' – sokmak, iğnelemek. 2. hali: **stung**, 3. hali: **stung**."
  },
  {
    "word": "territory",
    "definition": "An area that an animal or group claims and defends as its own.",
    "examples": [
      "Lions mark their territory by scent.",
      "The birds defended their territory from intruders."
    ],
    "notes": "Bölge, alan (hayvanların sahip çıktığı veya kontrol ettiği alan)."
  },
  {
    "word": "emerge",
    "definition": "To come out or appear from somewhere.",
    "examples": [
      "The ant emerged from her cocoon.",
      "After the rain, new plants began to emerge."
    ],
    "notes": "Ortaya çıkmak, görünmek."
  },
  {
    "word": "choke out",
    "definition": "To cause someone or something to stop functioning or survive by cutting off air or space.",
    "examples": [
      "The smoke choked out the fire.",
      "Pollution can choke out plant life in rivers."
    ],
    "notes": "Boğmak, nefes almayı engellemek."
  },
  {
    "word": "herbivore",
    "definition": "An animal that eats only plants.",
    "examples": [
      "Cows are herbivores.",
      "Most insects are herbivores."
    ],
    "notes": "Otçul hayvan."
  },
  {
    "word": "take refuge in",
    "definition": "To find shelter or protection in a place.",
    "examples": [
      "Birds take refuge in trees during storms.",
      "They took refuge in a cave during the storm."
    ],
    "notes": "Sığınmak, korunmak için bir yere gitmek."
  },
  {
    "word": "stagnant water",
    "definition": "Water that is not flowing or moving and often becomes stale or dirty.",
    "examples": [
      "Mosquitoes breed in stagnant water.",
      "Stagnant water can be a health hazard."
    ],
    "notes": "Durgun su."
  },
  {
    "word": "undergrowth",
    "definition": "Dense vegetation growing under trees in a forest.",
    "examples": [
      "The undergrowth was thick and hard to walk through.",
      "Animals hide in the undergrowth for safety."
    ],
    "notes": "Alt bitki örtüsü, ağaç altındaki yoğun bitkiler."
  },
  {
    "word": "walk past",
    "definition": "To go by something without stopping.",
    "examples": [
      "He walked right past a web.",
      "She walked past the store without noticing it."
    ],
    "notes": "Yanından geçmek."
  },
  {
    "word": "seal oneself in",
    "definition": "To close oneself off tightly or completely.",
    "examples": [
      "The spider seals herself in her web.",
      "They sealed themselves in the room during the storm."
    ],
    "notes": "Kendini tamamen kapatmak, içine kapatmak."
  },
  {
    "word": "young (noun plural)",
    "definition": "The offspring or young animals of a particular species.",
    "examples": [
      "The bird cared for her young.",
      "The lioness protected her young from danger."
    ],
    "notes": "Yavru, genç hayvanlar."
  },
  {
    "word": "rest (plural)",
    "definition": "The remaining part or people/things.",
    "examples": [
      "The rest follow the leader.",
      "After the first group left, the rest stayed."
    ],
    "notes": "'Rest' çoğul anlamda kullanılır; kalanlar, geri kalan."
  },
  {
    "word": "bloom",
    "definition": "To produce flowers; the flowers of a plant.",
    "examples": [
      "The flowers bloom in spring.",
      "The garden was full of colorful blooms."
    ],
    "notes": "Çiçek açmak, çiçek."
  },
  {
    "word": "mythical",
    "definition": "Relating to myths or legendary stories.",
    "examples": [
      "Dragons are mythical creatures.",
      "The story describes a mythical hero."
    ],
    "notes": "Efsanevi, mitolojik."
  },
  {
    "word": "scavenge",
    "definition": "To search for and collect usable items from discarded material; to feed on dead animals.",
    "examples": [
      "Vultures scavenge on carcasses.",
      "People scavenged for supplies after the disaster."
    ],
    "notes": "1. (Hayvanlar için) leşle beslenmek; 2. Atıklardan veya çöpten faydalı şeyler toplamak."
  },
  {
    "word": "terrain",
    "definition": "A stretch of land, especially with regard to its physical features.",
    "examples": [
      "The hikers struggled with the rough terrain.",
      "The terrain was rocky and uneven."
    ],
    "notes": "Arazi, arazi yapısı."
  },
  {
    "word": "moisture",
    "definition": "Tiny drops of water present in the air, soil, or on surfaces.",
    "examples": [
      "Plants need moisture to grow.",
      "There was moisture on the leaves after the rain."
    ],
    "notes": "Nem."
  },
  {
    "word": "wildfire",
    "definition": "A large, uncontrolled fire that spreads quickly over vegetation.",
    "examples": [
      "Wildfires destroyed large areas of forest.",
      "Firefighters worked to control the wildfire."
    ],
    "notes": "Orman yangını, kontrolsüz büyük yangın."
  },
  {
    "word": "sprout",
    "definition": "To begin to grow; a new growth from a seed or plant.",
    "examples": [
      "Seeds sprout after a few days in the soil.",
      "New leaves sprouted on the tree."
    ],
    "notes": "Filizlenmek, filiz."
  },
  {
    "word": "pests",
    "definition": "Animals or insects that damage crops or plants.",
    "examples": [
      "Farmers use pesticides to control pests.",
      "Pests destroyed much of the garden."
    ],
    "notes": "Zararlı böcekler veya hayvanlar."
  },
  {
    "word": "keep sth in check",
    "definition": "To control or limit something to prevent it from becoming too much.",
    "examples": [
      "Farmers try to keep pests in check.",
      "She kept her emotions in check during the meeting."
    ],
    "notes": "Bir şeyi kontrol altında tutmak, sınırlamak."
  },
  {
    "word": "medication",
    "definition": "Medicine used to treat illness or relieve symptoms.",
    "examples": [
      "He takes medication for his allergies.",
      "The doctor prescribed medication for the infection."
    ],
    "notes": "İlaç, tedavi amaçlı kullanılan ilaç."
  },
  {
    "word": "overtake",
    "definition": "To become more numerous, important, or successful than something else; to take control or cover something.",
    "examples": [
      "Plants overtook the landscape after the fire.",
      "Technology has overtaken many traditional jobs."
    ],
    "notes": "Ele geçirmek, geçmek, baskın hâle gelmek. Örnekte 'plants overtook the landscape': bitkiler manzarayı kapladı/hâkim oldu."
  },
  {
    "word": "barren",
    "definition": "Land that is too poor to produce much or any vegetation.",
    "examples": [
      "The desert was dry and barren.",
      "Nothing could grow in the barren soil."
    ],
    "notes": "Verimsiz, çorak (toprak)."
  },
  {
    "word": "vegetation",
    "definition": "Plants in general, especially those found in a particular area.",
    "examples": [
      "The region is known for its rich vegetation.",
      "Lush vegetation covered the hillsides."
    ],
    "notes": "Bitki örtüsü."
  },
  {
    "word": "log",
    "definition": "A large piece of a tree that has been cut down, especially for firewood or construction.",
    "examples": [
      "He sat on a log by the fire.",
      "They rolled the heavy log down the hill."
    ],
    "notes": "Kütük, kesilmiş ağaç parçası."
  },
  {
    "word": "batch of young",
    "definition": "A group of young animals born or hatched at the same time.",
    "examples": [
      "The frog laid a new batch of young in the pond.",
      "This batch of young turtles will hatch in a few days."
    ],
    "notes": "Aynı anda doğmuş ya da yumurtadan çıkmış yavru grubu. 'Batch' = grup, 'young' = yavrular."
  },
  {
    "word": "larvae",
    "definition": "The immature form of an insect that undergoes metamorphosis.",
    "examples": [
      "Mosquito larvae develop in stagnant water.",
      "The larvae will become butterflies in a few weeks."
    ],
    "notes": "Larva, bazı hayvanların (özellikle böceklerin) yavru hâli. Tekil: larva, çoğul: larvae."
  },
  {
    "word": "to stand watch",
    "definition": "To stay alert and keep guard or lookout, especially at night or in a dangerous situation.",
    "examples": [
      "We took turns standing watch at the campsite.",
      "A soldier stood watch outside the base."
    ],
    "notes": "Nöbet tutmak, gözlemci olarak beklemek."
  },
  {
    "word": "crickets",
    "definition": "Insects that make a chirping sound, often heard at night.",
    "examples": [
      "We could hear the crickets chirping in the grass.",
      "Crickets are active during warm summer nights."
    ],
    "notes": "Cırcır böcekleri."
  },
  {
    "word": "endow",
    "definition": "To provide with a quality, ability, or asset.",
    "examples": [
      "Nature has endowed the planet with rich resources.",
      "She was endowed with great intelligence."
    ],
    "notes": "Donatmak, bahşetmek. Genellikle soyut şeyler için kullanılır (zeka, yetenek, özellik)."
  },
  {
    "word": "fluid",
    "definition": "A substance that flows, such as a liquid or gas.",
    "examples": [
      "Water and oil are common fluids.",
      "The doctor examined the patient's bodily fluids."
    ],
    "notes": "Sıvı veya gaz hâlindeki akışkan madde."
  },
  {
    "word": "substance",
    "definition": "A particular kind of matter with uniform properties.",
    "examples": [
      "The substance was tested in the lab.",
      "They found a toxic substance in the water."
    ],
    "notes": "Madde, özellikle kimyasal veya fiziksel bir yapıya sahip olan şey."
  },
  {
    "word": "substrate",
    "definition": "The surface or material on or from which an organism lives, grows, or obtains nourishment.",
    "examples": [
      "The algae grows on the rocky substrate of the ocean floor.",
      "Mushrooms prefer a moist substrate to grow on."
    ],
    "notes": "Üzerinde organizmaların büyüdüğü ya da yaşadığı yüzey/malzeme."
  },
  {
    "word": "rifting",
    "definition": "The process of the Earth's crust breaking apart due to tectonic activity.",
    "examples": [
      "Rifting caused the formation of a new valley.",
      "The rifting of continents is a slow geological process."
    ],
    "notes": "Yer kabuğunun kırılması veya yarılması süreci (jeoloji terimi)."
  },
  {
    "word": "glaciers",
    "definition": "Large masses of ice that move slowly over land.",
    "examples": [
      "Glaciers carved deep valleys in the mountains.",
      "The glacier has been melting rapidly due to climate change."
    ],
    "notes": "Buzullar. Yavaş hareket eden büyük buz kütleleri."
  },
  {
    "word": "space probes",
    "definition": "Unmanned spacecraft that explore space and gather data.",
    "examples": [
      "The space probe sent back images of Saturn.",
      "NASA launched a new space probe to study the Sun."
    ],
    "notes": "Uzay sondaları. İnsan olmadan uzaya gönderilen veri toplama araçları."
  },
  {
    "word": "evaporate",
    "definition": "To change from a liquid into a gas.",
    "examples": [
      "The water evaporated in the hot sun.",
      "Perfume evaporates quickly after being sprayed."
    ],
    "notes": "Buharlaşmak. Sıvı hâlden gaz hâline geçmek."
  },
  {
    "word": "vent more gas into the atmosphere",
    "definition": "To release additional gas from a surface or system into the air.",
    "examples": [
      "Volcanoes vent more gas into the atmosphere during eruptions.",
      "Some factories vent harmful gases into the atmosphere."
    ],
    "notes": "Havaya (atmosfere) gaz salmak. ‘Vent’ fiili burada 'dışa bırakmak' anlamında."
  },
  {
    "word": "erode",
    "definition": "To gradually wear away soil, rock, or other material through natural forces.",
    "examples": [
      "Wind and rain eroded the cliffs over time.",
      "The coastline is eroding at an alarming rate."
    ],
    "notes": "Aşındırmak. Rüzgar, su vb. doğal etkenlerle zamanla yıpratmak."
  },
  {
    "word": "surface fluids",
    "definition": "Liquids found on the surface of a planet or moon.",
    "examples": [
      "Scientists found surface fluids on Saturn’s moon Titan.",
      "Surface fluids on Earth include lakes and rivers."
    ],
    "notes": "Yüzeyde bulunan sıvılar. Gezegen veya uyduların yüzeyindeki akışkan maddeler."
  },
  {
    "word": "freight",
    "definition": "Goods transported in bulk, usually by truck, train, ship, or aircraft.",
    "examples": [
      "The freight was loaded onto the ship.",
      "Freight trains carry large amounts of goods across the country."
    ],
    "notes": "Yük, taşınan ticari mal. Genellikle büyük miktarlarda taşınan mallar için kullanılır."
  },
  {
    "word": "commence",
    "definition": "To begin or start something.",
    "examples": [
      "The ceremony will commence at 10 a.m.",
      "They commenced building the bridge last year."
    ],
    "notes": "Başlamak, başlatmak (genellikle resmi veya yazılı dilde kullanılır)."
  },
  {
    "word": "It transformed from an empty wasteland to a thriving ecosystem",
    "definition": "It changed completely from a lifeless, barren area into a vibrant, living system.",
    "examples": [
      "It transformed from an empty wasteland to a thriving ecosystem in just a few months.",
      "With care and time, even deserts can transform into thriving ecosystems."
    ],
    "notes": "transform: dönüştürmek; empty wasteland: boş, verimsiz arazi; thriving ecosystem: gelişen, canlı ekosistem."
  },
  {
    "word": "the desert sun will dry up little pond",
    "definition": "The heat from the sun in the desert will cause the small pond to evaporate.",
    "examples": [
      "Without rain, the desert sun will dry up the little pond completely.",
      "In arid regions, the sun often dries up small bodies of water."
    ],
    "notes": "Desert: çöl, dry up: kurutmak, little pond: küçük gölet."
  },
  {
    "word": "the pond had dried up completely",
    "definition": "The pond lost all its water and became dry.",
    "examples": [
      "By the end of summer, the pond had dried up completely.",
      "The drought caused the pond to dry up completely."
    ],
    "notes": "Gölet tamamen kurumuş."
  },
  {
    "word": "teem",
    "definition": "To be full of or swarming with.",
    "examples": [
      "The forest teemed with wildlife.",
      "The river is teeming with fish in spring."
    ],
    "notes": "Kaynamak, dolup taşmak (canlı veya nesnelerle)."
  },
  {
    "word": "eggs lay dormant in the sand",
    "definition": "Eggs remain inactive or in a resting state in the sand.",
    "examples": [
      "The eggs lay dormant in the sand until the temperature rose.",
      "Some insects’ eggs can lie dormant for months."
    ],
    "notes": "Yumurtaların kumda hareketsiz kalması, gelişime başlamamış olması."
  },
  {
    "word": "to hatch",
    "definition": "To emerge from an egg.",
    "examples": [
      "The chicks hatched early in the morning.",
      "Reptiles usually hatch without help."
    ],
    "notes": "Yumurtadan çıkmak (canlılar için)."
  },
  {
    "word": "to huddle under sth",
    "definition": "To crowd together under something for warmth or protection.",
    "examples": [
      "The children huddled under the blanket.",
      "Animals huddle under trees during storms."
    ],
    "notes": "Bir şeyin altına sokulmak, sıkıca bir araya gelmek."
  },
  {
    "word": "caterpillar",
    "definition": "The larval stage of a butterfly or moth.",
    "examples": [
      "The caterpillar crawled across the leaf.",
      "Caterpillars eat a lot before becoming butterflies."
    ],
    "notes": "Tırtıl, kelebek ya da güve larvası."
  },
  {
    "word": "bean",
    "definition": "A seed or pod used as food, especially from the legume family.",
    "examples": [
      "She cooked a dish made with red beans.",
      "Beans grow well in warm climates."
    ],
    "notes": "Fasulye, baklagil tohumu."
  },
  {
    "word": "moth",
    "definition": "A nocturnal insect similar to a butterfly.",
    "examples": [
      "The moth was attracted to the light.",
      "Some moths have beautiful patterns on their wings."
    ],
    "notes": "Güve, gece uçan kelebek benzeri böcek."
  },
  {
    "word": "substantially",
    "definition": "Largely, significantly, or considerably.",
    "examples": [
      "The population has substantially increased.",
      "Their income was substantially higher this year."
    ],
    "notes": "Önemli ölçüde, büyük oranda."
  },
  {
    "word": "crustaceans",
    "definition": "Aquatic animals like crabs, lobsters, and shrimp with hard shells.",
    "examples": [
      "Crustaceans live in both freshwater and saltwater.",
      "The crab is a type of crustacean."
    ],
    "notes": "Kabuklu deniz hayvanları (yengeç, karides, ıstakoz vb.)."
  },
  {
    "word": "delicate",
    "definition": "Easily broken or damaged; fragile.",
    "examples": [
      "The coral reef is a delicate ecosystem.",
      "Be careful, the vase is very delicate."
    ],
    "notes": "Hassas, kırılgan, narin."
  },
  {
      "word": "to breed",
      "definition": "To produce offspring through reproduction.",
      "examples": [
          "Many animals breed in the spring.",
          "The farm breeds horses for racing."
      ],
      "notes": "Üremek, yavrulamak; yetiştirmek (özellikle hayvanlar için)."
  },
  {
      "word": "beetle",
      "definition": "A type of insect with hard wing covers.",
      "examples": [
          "The beetle crawled under the rock.",
          "Ladybugs are a type of beetle."
      ],
      "notes": "Böcek türü. Genellikle sert kabukludur."
  },
  {
      "word": "to feign",
      "definition": "To pretend or fake something.",
      "examples": [
          "He feigned illness to avoid going to school.",
          "The lizard feigned death to escape the predator."
      ],
      "notes": "Numara yapmak, taklit etmek."
  },
  {
      "word": "sunscreen",
      "definition": "A lotion or spray that protects the skin from sun damage.",
      "examples": [
          "Always wear sunscreen at the beach.",
          "She applied sunscreen to avoid sunburn."
      ],
      "notes": "Güneş kremi."
  },
  {
      "word": "powder",
      "definition": "Dry, soft particles (noun); to cover with or turn into powder (verb).",
      "examples": [
          "She used baby powder after the bath.",
          "The sugar was powdered on top of the cake."
      ],
      "notes": "Toz (isim); toz haline getirmek veya tozla kaplamak (fiil)."
  },
  {
      "word": "abdomen",
      "definition": "The part of the body containing digestive organs; in insects, the rear body segment.",
      "examples": [
          "The insect’s abdomen was swollen.",
          "Pain in the abdomen can have many causes."
      ],
      "notes": "Karın bölgesi; böceklerde vücutlarının arka kısmı."
  },
  {
      "word": "doom",
      "definition": "A terrible fate or unavoidable bad outcome.",
      "examples": [
          "The ship sailed toward its doom.",
          "The character’s doom was sealed early in the story."
      ],
      "notes": "Kaçınılmaz kötü son, kader."
  },
  {
      "word": "a stalemate",
      "definition": "A situation where neither side can make progress or win.",
      "examples": [
          "The negotiation ended in a stalemate.",
          "The chess match resulted in a stalemate."
      ],
      "notes": "Çıkmaz, tıkanıklık, berabere durum."
  },
  {
      "word": "the tank began to flood",
      "definition": "Water started to fill the tank uncontrollably.",
      "examples": [
          "Suddenly, the tank began to flood.",
          "They evacuated the room as the tank began to flood."
      ],
      "notes": "Tank suyla dolmaya başladı (taşma, sızma durumu)."
  },
  {
      "word": "teeming with life",
      "definition": "Full of many living organisms.",
      "examples": [
          "The coral reef was teeming with life.",
          "The pond was once again teeming with life after the rain."
      ],
      "notes": "Hayatla dolu, canlılarla kaynayan."
  },
  {
      "word": "juveniles",
      "definition": "Young individuals of a species, not yet fully mature.",
      "examples": [
          "Juvenile crocodiles stay near water for protection.",
          "The zoo has a special area for juvenile animals."
      ],
      "notes": "Genç bireyler, henüz erişkin olmayan hayvanlar."
  },
  {
      "word": "shedding skin",
      "definition": "The process of losing or removing old skin to allow new growth.",
      "examples": [
          "Snakes shed their skin regularly as they grow.",
          "Shedding skin helps reptiles remove parasites."
      ],
      "notes": "Deri değiştirme, eski derinin atılması."
  },
  {
      "word": "counterpart",
      "definition": "Someone or something that has the same function or position in a different place or situation.",
      "examples": [
          "The American ambassador met with his French counterpart.",
          "The crocodile is the freshwater counterpart of the alligator."
      ],
      "notes": "Benzer görev veya konumda olan kişi ya da şey."
  },
  {
      "word": "hollow",
      "definition": "Having a space or empty area inside.",
      "examples": [
          "The tree trunk was hollow and filled with insects.",
          "Some bones are hollow to reduce weight."
      ],
      "notes": "İçi boş, oyuk."
  },
  {
      "word": "running rampant",
      "definition": "Spreading quickly and uncontrollably.",
      "examples": [
          "Rumors were running rampant after the announcement.",
          "Disease can run rampant in crowded conditions."
      ],
      "notes": "Hızla yayılmak, kontrolden çıkmak."
  },
  {
      "word": "vicious",
      "definition": "Violently dangerous or aggressive.",
      "examples": [
          "The dog became vicious when it felt threatened.",
          "That was a vicious attack on the suspect."
      ],
      "notes": "Aşırı agresif, saldırgan, kötü niyetli."
  },
  {
      "word": "make short work of sth",
      "definition": "To finish or deal with something quickly and easily.",
      "examples": [
          "The lion made short work of its prey.",
          "He made short work of the essay assignment."
      ],
      "notes": "Bir işi hızla ve kolayca bitirmek."
  },
  {
      "word": "alongside",
      "definition": "Next to or together with.",
      "examples": [
          "The soldiers fought alongside their allies.",
          "He works alongside engineers on the project."
      ],
      "notes": "Yanında, birlikte."
  },
  {
      "word": "burrow",
      "definition": "To dig a hole or tunnel for shelter; a hole or tunnel made by an animal.",
      "examples": [
          "The rabbit burrowed into the ground.",
          "Foxes live in burrows under the trees."
      ],
      "notes": "Oyuk kazmak (fiil); oyuk, yuva (isim)."
  },
  {
      "word": "The scorpion glows a radioactive green under UV light",
      "definition": "Scorpions appear to glow under ultraviolet light due to chemicals in their exoskeleton.",
      "examples": [
          "When we shined the UV flashlight, the scorpion glowed green.",
          "Scientists still study why scorpions glow under UV light."
      ],
      "notes": "UV ışığında yeşil parlamaları, dış iskeletlerindeki özel maddeler nedeniyle olur."
  },
  {
      "word": "crocodilians",
      "definition": "Large, carnivorous, semi-aquatic reptiles including crocodiles, alligators, caimans, and gharials.",
      "examples": [
          "Crocodilians are known for their powerful jaws and stealthy hunting.",
          "Most crocodilians live in freshwater habitats like rivers and lakes."
      ],
      "notes": "Timsahgiller. Timsah, alligator ve benzeri büyük sürüngenleri kapsar."
  },
  {
      "word": "care for a crocodilian",
      "definition": "To provide food, shelter, and health support for a crocodilian in captivity.",
      "examples": [
          "Zookeepers are trained to care for crocodilians safely.",
          "It takes experience to care for a crocodilian properly."
      ],
      "notes": "Bir timsahgile bakmak, ilgilenmek (beslemek, sağlık vb.)."
  },
  {
      "word": "captivity",
      "definition": "The condition of being kept in a confined space and not in the wild.",
      "examples": [
          "The animals were born in captivity and have never lived in the wild.",
          "Keeping wild animals in captivity is controversial."
      ],
      "notes": "Esaret, doğal ortam dışında tutulma durumu."
  },
  {
      "word": "compel",
      "definition": "To force or strongly persuade someone to do something.",
      "examples": [
          "The law compels citizens to pay taxes.",
          "She felt compelled to tell the truth."
      ],
      "notes": "Zorlamak, mecbur bırakmak."
  },
  {
      "word": "to specialize in sth",
      "definition": "To focus on and become an expert in a particular subject or activity.",
      "examples": [
          "He specializes in reptile behavior.",
          "The doctor specializes in heart surgery."
      ],
      "notes": "Bir alanda uzmanlaşmak."
  },
  {
      "word": "to proceed to do sth",
      "definition": "To continue by doing something after a previous step.",
      "examples": [
          "She proceeded to explain the entire plan.",
          "After the break, the team proceeded to build the model."
      ],
      "notes": "Bir şey yapmaya devam etmek ya da bir sonraki adıma geçmek."
  },
  {
      "word": "substrate",
      "definition": "The surface or material on which an organism lives or grows.",
      "examples": [
          "The lizard burrowed into the sandy substrate.",
          "Different animals prefer different substrates."
      ],
      "notes": "Canlının yaşadığı zemin veya yüzey."
  },
  {
      "word": "cactus vs. cacti",
      "definition": "‘Cactus’ is the singular form, ‘cacti’ is the plural.",
      "examples": [
          "I have a cactus on my desk.",
          "The desert is full of cacti."
      ],
      "notes": "Cactus (tekil), cacti (çoğul)."
  },
  {
      "word": "spines",
      "definition": "Sharp, needle-like structures found on certain plants and animals.",
      "examples": [
          "Cacti have spines instead of leaves.",
          "The hedgehog's back is covered with spines."
      ],
      "notes": "Dikenler."
  },
  {
      "word": "detrivores",
      "definition": "Organisms that feed on dead organic matter.",
      "examples": [
          "Earthworms and some insects are detrivores.",
          "Detrivores help recycle nutrients in ecosystems."
      ],
      "notes": "Çürükçül canlılar. Ölü organik madde ile beslenirler."
  },
  {
    "word": "participate in a survey",
    "definition": "To take part in answering questions for research or feedback purposes.",
    "examples": [
      "Over 1,000 people participated in the online survey.",
      "Students were asked to participate in a survey about their study habits."
    ],
    "notes": "Bir ankete katılmak. Genellikle bilgi toplamak veya görüş almak amacıyla yapılır."
  },
  {
    "word": "lids",
    "definition": "Covers or tops for containers such as jars, boxes, or cups.",
    "examples": [
      "She forgot to put the lids on the coffee cups.",
      "The pot lids were rattling from the boiling water."
    ],
    "notes": "Kapaklar. Kavanoz, tencere, bardak gibi şeylerin üstünü örten parça."
  },
  {
    "word": "stains",
    "definition": "Marks or discolorations that are difficult to remove, often caused by liquids or dirt.",
    "examples": [
      "There were coffee stains on the tablecloth.",
      "Red wine stains are hard to clean from clothes."
    ],
    "notes": "Leke, iz. Özellikle kalıcı ve zor çıkan türden kirler."
  },
  {
    "word": "spills",
    "definition": "Accidental flows or drops of a liquid that fall or leak from a container.",
    "examples": [
      "He cleaned up the milk spills from the kitchen floor.",
      "There were several oil spills in the ocean last year."
    ],
    "notes": "Dökülme, sıvı saçılması. Kazara olan sıvı taşmaları."
  },
  {
    "word": "disperse",
    "definition": "To spread or scatter something over a wide area.",
    "examples": [
      "The wind helped disperse the seeds across the field.",
      "The police used tear gas to disperse the crowd."
    ],
    "notes": "Dağıtmak, yaymak (özellikle insanlar, tohumlar, parçacıklar vb. için)."
  },
  {
    "word": "dispersal",
    "definition": "The act or process of spreading things over a wide area.",
    "examples": [
      "Seed dispersal is essential for plant reproduction.",
      "The dispersal of fog allowed us to see the road clearly."
    ],
    "notes": "Dağılma, yayılma. Genellikle doğal süreçlerde (tohum, sis vb.) kullanılır."
  },
  {
    "word": "dissipate",
    "definition": "To disappear gradually or to cause something to disappear.",
    "examples": [
      "The storm clouds slowly dissipated by morning.",
      "Her fear began to dissipate once she entered the room."
    ],
    "notes": "Yavaş yavaş dağılmak, yok olmak. Genellikle sis, korku, enerji vb. soyut şeyler için."
  },
  {
    "word": "dandelion",
    "definition": "A common plant with bright yellow flowers and fluffy seed heads.",
    "examples": [
      "Children love to blow dandelion seeds into the air.",
      "A single dandelion can release hundreds of seeds."
    ],
    "notes": "Karahindiba. Sarı çiçekli, tohumlarını rüzgârla dağıtan bitki."
  },
  {
    "word": "breeze",
    "definition": "A gentle and light wind.",
    "examples": [
      "A cool breeze came through the window.",
      "The breeze helped the dandelion seeds travel far."
    ],
    "notes": "Hafif rüzgâr, meltem."
  },
  {
    "word": "fluffy",
    "definition": "Light, soft, and airy in texture or appearance.",
    "examples": [
      "The kitten’s fur was soft and fluffy.",
      "Dandelions turn into fluffy white balls when they go to seed."
    ],
    "notes": "Yumuşak ve kabarık. Genellikle tüy, bulut, tohum başı gibi şeyler için kullanılır."
  },
  {
    "word": "nutrition",
    "definition": "The process of getting the food necessary for health and growth.",
    "examples": [
      "Good nutrition is important for growing children.",
      "The doctor gave her advice about proper nutrition."
    ],
    "notes": "Beslenme, vücudun büyüme ve sağlık için ihtiyaç duyduğu şeyleri alma süreci."
  },
  {
    "word": "nutrient",
    "definition": "A substance that provides nourishment essential for growth and health.",
    "examples": [
      "Soil provides nutrients for plants to grow.",
      "Calcium is an important nutrient for bones."
    ],
    "notes": "Besin öğesi, vücuda fayda sağlayan maddeler."
  },
  {
    "word": "seedling",
    "definition": "A young plant that has grown from a seed.",
    "examples": [
      "The gardener planted the seedlings in rows.",
      "Each seedling needs sunlight and water to grow."
    ],
    "notes": "Fideler; tohumdan yeni çıkmış küçük bitkiler."
  },
  {
    "word": "stalls",
    "definition": "Small enclosed spaces or booths used for selling goods or for other purposes.",
    "examples": [
      "Food stalls lined the streets during the festival.",
      "We bought souvenirs from the market stalls."
    ],
    "notes": "Tezgahlar, küçük satış noktaları. Ayrıca tuvalet bölmesi gibi anlamlarda da kullanılabilir (toilet stalls)."
  },
  {
    "word": "lean",
    "definition": "To rest or incline at an angle, often for support.",
    "examples": [
      "She leaned against the wall, looking tired.",
      "Don’t lean too far out of the window."
    ],
    "notes": "Dayanmak, yaslanmak. Ayrıca 'lean' sıfat olarak 'zayıf, yağsız (et)' anlamına da gelir."
  },
  {
    "word": "bolster",
    "definition": "To support or strengthen something.",
    "examples": [
      "They tried to bolster his confidence before the exam.",
      "Extra evidence bolstered the argument."
    ],
    "notes": "Desteklemek, güçlendirmek (soyut anlamda)."
  },
  {
    "word": "dissipate",
    "definition": "To gradually disappear or become less; to scatter.",
    "examples": [
      "The fog began to dissipate as the sun rose.",
      "Her anger dissipated after a few minutes."
    ],
    "notes": "Dağılmak, yok olmak, azalmak."
  },
  {
    "word": "soar (temperature)",
    "definition": "To rise rapidly or to a very high level.",
    "examples": [
      "Temperatures soared above 40°C last summer.",
      "As the sun came out, the heat soared."
    ],
    "notes": "Hızla yükselmek. Genellikle sıcaklık, fiyat, his gibi şeyler için kullanılır."
  },
  {
    "word": "dehydration",
    "definition": "A condition caused by excessive loss of water from the body.",
    "examples": [
      "He suffered from dehydration after hiking without enough water.",
      "Dehydration can be dangerous if not treated quickly."
    ],
    "notes": "Susuz kalma, vücuttaki sıvı kaybı."
  },
  {
    "word": "print your files from / off of the library computers",
    "definition": "Different phrasing for expressing the same action—formal vs. informal.",
    "examples": [
      "Formal: You can print your files from the library computers.",
      "Informal: Just print your files off of the library computers."
    ],
    "notes": "🟡 'from' daha resmi ve yazılı dilde tercih edilir. 🗨️ 'off of' ise konuşma dilinde yaygındır ama fazladan 'of' gramer açısından gereksiz sayılır. İkisi de aynı anlama gelir: dosyaları kütüphane bilgisayarlarını kullanarak yazdırmak."
  },
  {
    "word": "Within this tank, lives a miniature world",
    "definition": "A sentence with inverted word order where the subject follows the verb for emphasis.",
    "examples": [
      "Within this tank, lives a miniature world full of tiny creatures.",
      "On the hill stood a lonely old tree."
    ],
    "notes": "Devrik cümle: Normalde 'A miniature world lives within this tank.' şeklinde olur. Burada 'lives' fiili önce, özne sonra gelir; vurgu yapmak için kullanılır."
  },
  {
    "word": "partnerships will form / partnerships will be formed",
    "definition": "Active voice vs passive voice for future tense.",
    "examples": [
      "Partnerships will form between the two companies.",
      "Partnerships will be formed after the meeting."
    ],
    "notes": "'Partnerships will form' aktif (etken) yapıdır, özne (partnerships) işi yapar. 'Partnerships will be formed' ise pasif (edilgen) yapıdır, iş başkası tarafından yapılır. İkisi anlam olarak benzer ama kullanım farklıdır."
  },
  {
    "word": "despite all odds",
    "definition": "Although something is very unlikely or difficult.",
    "examples": [
      "Despite all odds, she completed the marathon.",
      "They succeeded despite all odds."
    ],
    "notes": "Bütün zorluklara rağmen, umulmadık şekilde."
  },
  {
    "word": "barren wasteland",
    "definition": "A dry, empty, and infertile area of land.",
    "examples": [
      "The desert was a barren wasteland with no vegetation.",
      "After the fire, the forest became a barren wasteland."
    ],
    "notes": "Çorak arazi, verimsiz ve çıplak toprak."
  },
  {
    "word": "to thrive",
    "definition": "To grow, develop, or be successful.",
    "examples": [
      "Plants thrive in this climate.",
      "The business is thriving despite the recession."
    ],
    "notes": "Gelişmek, büyümek, başarılı olmak."
  },
  {
    "word": "thriving ecosystem",
    "definition": "An ecosystem that is healthy and growing.",
    "examples": [
      "The coral reef is a thriving ecosystem.",
      "A thriving ecosystem supports many species."
    ],
    "notes": "Sağlıklı ve gelişmekte olan ekosistem."
  },
  {
    "word": "fortress",
    "definition": "A strong building used for defense.",
    "examples": [
      "The castle was built as a fortress against invaders.",
      "The fortress stood on the hill, guarding the city."
    ],
    "notes": "Kale, hisar."
  },
  {
    "word": "coral",
    "definition": "Marine invertebrates that build reefs.",
    "examples": [
      "Colorful coral attracts many fish.",
      "Coral reefs are important marine habitats."
    ],
    "notes": "Mercan; deniz canlılarının oluşturduğu yapılar."
  },
  {
    "word": "refuge (noun and verb)",
    "definition": "Noun: a safe place; Verb: to seek shelter.",
    "examples": [
      "The forest was a refuge for endangered species.",
      "The animals refuged in the caves during the storm."
    ],
    "notes": "İsim: sığınak, korunma yeri. Fiil: sığınmak, korunmak."
  },
  {
    "word": "refugee",
    "definition": "A person who flees their country due to danger or persecution.",
    "examples": [
      "Thousands of refugees crossed the border.",
      "The refugee camp provided shelter and food."
    ],
    "notes": "Mülteci."
  },
  {
    "word": "reef",
    "definition": "A ridge of rock, coral, or sand near the water surface.",
    "examples": [
      "The reef was teeming with colorful fish.",
      "Divers explored the coral reef."
    ],
    "notes": "Resif."
  },
  {
    "word": "hideout",
    "definition": "A place used for hiding.",
    "examples": [
      "The criminals had a secret hideout in the forest.",
      "They used the cave as a hideout from the storm."
    ],
    "notes": "Saklanma yeri."
  },
  {
    "word": "commotion",
    "definition": "A state of noisy confusion or disturbance.",
    "examples": [
      "There was a commotion in the street after the accident.",
      "The sudden noise caused a commotion in the classroom."
    ],
    "notes": "Kargaşa, yaygara."
  },
  {
    "word": "burrow",
    "definition": "To dig a hole or tunnel, especially for shelter.",
    "examples": [
      "Rabbits burrow underground to make their homes.",
      "The mole burrowed deep into the soil."
    ],
    "notes": "Oyuk kazmak, in yapmak."
  },
  {
    "word": "to graze",
    "definition": "To feed on grass; also to eat small amounts of food throughout the day.",
    "examples": [
      "Cows graze in the pasture all day.",
      "She grazed on fruit and nuts between meals."
    ],
    "notes": "Otlamak (hayvan), hafif hafif atıştırmak (insan)."
  },
  {
    "word": "to take shelter",
    "definition": "To find a safe place during bad weather or danger.",
    "examples": [
      "We took shelter under a tree during the storm.",
      "Birds take shelter in thick bushes."
    ],
    "notes": "Sığınmak, korunmak."
  },
  {
    "word": "debris",
    "definition": "Scattered pieces of waste or remains.",
    "examples": [
      "After the storm, debris was scattered everywhere.",
      "The cleanup crew removed debris from the road."
    ],
    "notes": "Enkaz, döküntü."
  },
  {
    "word": "filter out",
    "definition": "To remove unwanted substances by passing through a filter.",
    "examples": [
      "The machine filters out impurities from the water.",
      "He filtered out the noise from the recording."
    ],
    "notes": "Filtrelemek, arıtmak."
  },
  {
    "word": "sponges",
    "definition": "Simple aquatic animals that filter water to feed.",
    "examples": [
      "Sponges clean the water by filtering it.",
      "They found colorful sponges on the ocean floor."
    ],
    "notes": "Süngerler (deniz canlısı)."
  },
  {
    "word": "By day 72, the reef had become a refuge for many forms of life",
    "definition": "Past perfect tense used to emphasize the state before a certain time.",
    "examples": [
      "By day 72, the reef had become a refuge.",
      "By the time we arrived, she had already left."
    ],
    "notes": "'Had become' geçmişte bir zamana kadar tamamlanmış bir durumu anlatır. 'Have become' şimdiki zamana yakın veya etkisi süren durumlarda kullanılır."
  },
  {
    "word": "slug",
    "definition": "A small, slimy, shell-less mollusk.",
    "examples": [
      "The garden was full of slugs after the rain.",
      "Slugs move slowly across the leaves."
    ],
    "notes": "Sümüklüböcek."
  },
  {
    "word": "slime coat on their skin",
    "definition": "A slippery, protective layer covering the skin of some animals.",
    "examples": [
      "Frogs have a slime coat that keeps their skin moist.",
      "The fish’s slime coat protects it from infections."
    ],
    "notes": "Derideki sümüksü tabaka, koruyucu tabaka."
  },
  {
    "word": "pile of bones",
    "definition": "A heap of skeletal remains.",
    "examples": [
      "The predator left a pile of bones after feeding.",
      "Archaeologists discovered a pile of bones in the cave."
    ],
    "notes": "Kemik yığını."
  },
  {
    "word": "as day turns to night",
    "definition": "An expression describing the transition from daytime to nighttime.",
    "examples": [
      "As day turns to night, the city lights up.",
      "Animals prepare for rest as day turns to night."
    ],
    "notes": "Gündüzün geceye dönmesi, gün batımı."
  },
  {
    "word": "shrimp",
    "definition": "A small marine crustacean with a long body and antennae.",
    "examples": [
      "Shrimp are commonly used in cooking.",
      "We saw colorful shrimp in the coral reef."
    ],
    "notes": "Karides."
  },
  {
    "word": "The coral puts on a show",
    "definition": "An expression meaning the coral displays impressive or colorful activity.",
    "examples": [
      "At sunrise, the coral puts on a show of vibrant colors.",
      "The reef puts on a show for divers."
    ],
    "notes": "Mercan canlı bir gösteri sunar (canlı ve renkli etkinlik)."
  },
  {
    "word": "wetland",
    "definition": "An area of land that is covered with shallow water either permanently or seasonally.",
    "examples": [
      "Wetlands are important habitats for many species of birds and amphibians.",
      "The government is working to protect coastal wetlands from pollution."
    ],
    "notes": "Sulak alan. Sürekli ya da mevsimsel olarak suyla kaplı kara parçası."
  },
  {
    "word": "wells",
    "definition": "Deep holes drilled into the ground to access water, oil, or other resources.",
    "examples": [
      "Villagers rely on wells for their daily water supply.",
      "Some wells dried up during the drought."
    ],
    "notes": "Kuyular. Genellikle yer altı suyu ya da diğer doğal kaynakları çıkarmak için açılan derin çukurlar."
  },
  {
    "word": "adversity",
    "definition": "A difficult or unpleasant situation; hardship or misfortune.",
    "examples": [
      "He showed courage in the face of adversity.",
      "The team overcame great adversity to win the championship."
    ],
    "notes": "Zorluk, sıkıntılı durum, musibet anlamındadır. Genellikle uzun süren veya büyük engeller için kullanılır."
  },
  {
    "word": "to dispute",
    "definition": "To argue or disagree about something.",
    "examples": [
      "They disputed the results of the election.",
      "The scientists disputed the validity of the findings."
    ],
    "notes": "Tartışmak, itiraz etmek, karşı çıkmak."
  },
  {
    "word": "to become extinct / go extinct",
    "definition": "To no longer exist; to die out completely.",
    "examples": [
      "Many species have become extinct due to habitat loss.",
      "Dinosaurs went extinct millions of years ago."
    ],
    "notes": "Nesli tükenmek. Eşanlamlılar: 'die out', 'disappear'. İsim hali: extinction (neslin tükenmesi)."
  },
  {
    "word": "to posit",
    "definition": "To suggest or put forward an idea or theory as a basis for discussion.",
    "examples": [
      "The scientist posited a new theory on climate change.",
      "He posited that all people are inherently good."
    ],
    "notes": "İleri sürmek, öne sürmek (teorik veya fikirsel bir iddia)."
  },
  {
    "word": "to elaborate",
    "definition": "To explain or describe in more detail.",
    "examples": [
      "Could you elaborate on your plan?",
      "She elaborated her argument with examples and data."
    ],
    "notes": "Ayrıntılandırmak, detaylandırmak."
  },
  {
    "word": "ponds",
    "definition": "Small bodies of still water, typically smaller than lakes.",
    "examples": [
      "Frogs live in ponds and wetlands.",
      "We saw ducks swimming in the pond."
    ],
    "notes": "Gölet, küçük su birikintisi."
  },
  {
    "word": "to outpace",
    "definition": "To go faster or do better than someone or something.",
    "examples": [
      "The company outpaced its competitors in sales.",
      "Demand for resources has outpaced supply."
    ],
    "notes": "Geride bırakmak, daha hızlı olmak, geçmek."
  },
  {
    "word": "to replenish",
    "definition": "To fill something up again; to restore.",
    "examples": [
      "We need to replenish the food supplies.",
      "The lake is replenished by rainfall."
    ],
    "notes": "Yeniden doldurmak, tazelemek, eski hâline getirmek."
  },
  {
    "word": "drinkable water",
    "definition": "Water that is safe to drink; potable water.",
    "examples": [
      "Access to drinkable water is a global issue.",
      "Not all tap water is drinkable in some countries."
    ],
    "notes": "İçilebilir su. Eşanlamlı: potable water."
  },
  {
    "word": "diminish",
    "definition": "To make or become less.",
    "examples": [
      "His influence has diminished over the years.",
      "The pain gradually diminished after taking medicine."
    ],
    "notes": "Azalmak, azaltmak."
  },
  {
    "word": "purify",
    "definition": "To make something clean or free from harmful substances.",
    "examples": [
      "They use filters to purify the water.",
      "The air is purified through a special system."
    ],
    "notes": "Arıtmak, saflaştırmak."
  },
  {
    "word": "contaminated water",
    "definition": "Water that has been made impure or unsafe by contact with harmful substances.",
    "examples": [
      "Drinking contaminated water can cause diseases.",
      "The flood left the wells contaminated."
    ],
    "notes": "Kirlenmiş, zararlı maddeler içeren su."
  },
  {
    "word": "bleak",
    "definition": "Cold, depressing, or without hope.",
    "examples": [
      "The future looks bleak if no action is taken.",
      "They walked through a bleak, empty landscape."
    ],
    "notes": "Kasvetli, iç karartıcı, umutsuz."
  },
  {
    "word": "to diverge",
    "definition": "To separate or go in different directions.",
    "examples": [
      "The two paths diverge at the top of the hill.",
      "Their opinions diverged on how to solve the issue."
    ],
    "notes": "Ayrılmak, farklı yönlere gitmek (fikirler veya yollar için)."
  },
  {
    "word": "to polish",
    "definition": "To make something smooth and shiny by rubbing it.",
    "examples": [
      "He polished the table until it shone.",
      "You should polish your shoes before the interview."
    ],
    "notes": "Parlatmak, cilalamak."
  },
  {
    "word": "a means / means",
    "definition": "A method or way of doing something; singular and plural forms are the same.",
    "examples": [
      "Education is a means of personal growth.",
      "They had no means of communication during the storm."
    ],
    "notes": "'Means' hem tekil hem çoğul olarak kullanılır. Anlamı: araç, yol, yöntem."
  },
  {
    "word": "compel",
    "definition": "To force or strongly persuade someone to do something.",
    "examples": [
      "The law compels employers to pay a minimum wage.",
      "His performance compelled everyone to stand and applaud."
    ],
    "notes": "Zorlamak, mecbur bırakmak. Güçlü bir etkiyle birini bir şey yapmaya yönlendirmek anlamındadır."
  },
  {
    "word": "evoke",
    "definition": "To bring a feeling, memory, or image into the mind.",
    "examples": [
      "The music evoked memories of her childhood.",
      "His speech evoked a sense of hope in the crowd."
    ],
    "notes": "Anımsatmak, çağrışım yapmak, duyguları harekete geçirmek."
  },
  {
    "word": "faint outlines",
    "definition": "Very weak or barely visible shapes or edges.",
    "examples": [
      "They could see the faint outlines of mountains in the distance.",
      "The old photo showed the faint outlines of a building."
    ],
    "notes": "Belli belirsiz, silik şekiller ya da hatlar."
  },
  {
    "word": "trait",
    "definition": "A distinguishing quality or characteristic, typically of a person.",
    "examples": [
      "Honesty is a valuable trait in a friend.",
      "Eye color is a genetic trait."
    ],
    "notes": "Özellik, kişisel ya da genetik bir nitelik."
  },
  {
    "word": "perpetuate their genes",
    "definition": "To cause their genes to continue to exist or be passed on through generations.",
    "examples": [
      "Organisms reproduce to perpetuate their genes.",
      "Some behaviors increase the chance to perpetuate their genes."
    ],
    "notes": "Genlerini devam ettirmek, kalıcı hâle getirmek anlamındadır."
  },
  {
    "word": "pass on their genes",
    "definition": "To transmit genetic material to the next generation.",
    "examples": [
      "Healthy individuals are more likely to pass on their genes.",
      "Animals reproduce to pass on their genes."
    ],
    "notes": "Genlerini aktarmak, bir sonraki nesle iletmek."
  },
  {
    "word": "innate",
    "definition": "Inborn; natural and not learned or acquired.",
    "examples": [
      "Humans have an innate ability to learn language.",
      "Some fears are considered to be innate."
    ],
    "notes": "Doğuştan gelen, içgüdüsel."
  },
  {
    "word": "inborn",
    "definition": "Naturally present at birth; not learned or acquired.",
    "examples": [
      "He has an inborn talent for music.",
      "The instinct to survive is inborn in all animals."
    ],
    "notes": "Doğuştan gelen, kalıtsal (innate ile eşanlamlı)."
  },
  {
    "word": "instinctual",
    "definition": "Based on instinct; not involving thought or training.",
    "examples": [
      "Protecting one's children is often an instinctual behavior.",
      "Many animals display instinctual reactions to danger."
    ],
    "notes": "İçgüdüsel, düşünmeden yapılan davranışlara ilişkin."
  },
  {
    "word": "gravitate toward",
    "definition": "To be attracted or drawn toward something or someone.",
    "examples": [
      "People tend to gravitate toward others with similar interests.",
      "Children often gravitate toward colorful toys."
    ],
    "notes": "Doğal olarak yönelmek, ilgi duymak."
  },
  {
    "word": "settings",
    "definition": "The time, place, and circumstances in which something occurs.",
    "examples": [
      "This kind of teamwork often leads to deeper connections than we form in other settings.",
      "The story takes place in a rural setting."
    ],
    "notes": "'Setting' ortam, bağlam, koşullar demektir. Çoğul haliyle farklı ortamları ifade eder."
  },
  {
    "word": "get together",
    "definition": "To meet socially or gather for a shared activity.",
    "examples": [
      "Let’s get together for coffee sometime.",
      "We usually get together with friends on weekends."
    ],
    "notes": "Bir araya gelmek, sosyal amaçlı buluşmak anlamındadır."
  },
  {
    "word": "come together",
    "definition": "To unite or work as a group, often toward a common goal.",
    "examples": [
      "People came together to support the victims.",
      "The team came together and won the game."
    ],
    "notes": "Bir araya gelmek, birleşmek, ortak bir amaç için toplanmak."
  },
  {
    "word": "had our families meet each other",
    "definition": "To cause someone to do something; this is a causative structure using 'have'.",
    "examples": [
      "We even had our families meet each other.",
      "They had the mechanic check the car before the trip."
    ],
    "notes": "‘Have + object + verb’ yapısı başkasına bir şey yaptırmak anlamındadır. (Causative structure)"
  },
  {
    "word": "meet with someone",
    "definition": "To have a formal or planned meeting with someone.",
    "examples": [
      "I met with the manager to discuss the proposal.",
      "She met with her advisor to go over the schedule."
    ],
    "notes": "Genellikle iş veya resmi konular için kullanılır."
  },
  {
    "word": "meet someone",
    "definition": "To come into contact with someone, either planned or by chance.",
    "examples": [
      "I met her at a conference.",
      "Have you ever met a celebrity?"
    ],
    "notes": "Biriyle tanışmak ya da karşılaşmak anlamındadır. 'With' kullanılmaz."
  },
  {
    "word": "proceeds",
    "definition": "The money earned from an event or activity.",
    "examples": [
      "Part of the proceeds goes towards a charitable cause.",
      "All proceeds from the concert will go to charity."
    ],
    "notes": "'Proceeds' gelir, kazanç anlamına gelir ve her zaman çoğul olarak kullanılır."
  },
  {
    "word": "charitable",
    "definition": "Related to giving help to those in need.",
    "examples": [
      "They donated to a charitable foundation.",
      "Charitable organizations help the poor and sick."
    ],
    "notes": "Hayırsever, yardım amaçlı demektir."
  },
  {
    "word": "compassionate",
    "definition": "Showing sympathy and concern for others’ suffering.",
    "examples": [
      "She is a compassionate nurse who cares for her patients deeply.",
      "He offered a compassionate response to the tragedy."
    ],
    "notes": "Şefkatli, merhametli anlamındadır."
  },
  {
    "word": "betterment",
    "definition": "The process of improving something.",
    "examples": [
      "They worked for the betterment of the community.",
      "Education plays a key role in social betterment."
    ],
    "notes": "İyileştirme, gelişme anlamındadır."
  },
  {
    "word": "marketing ploy",
    "definition": "A clever tactic used to attract customers or promote a product.",
    "examples": [
      "It turned out to be just a marketing ploy.",
      "Giving free samples is a common marketing ploy."
    ],
    "notes": "Pazarlama taktiği, dikkat çekici strateji."
  },
  {
    "word": "appealing to",
    "definition": "Attractive or interesting to a particular person or group.",
    "examples": [
      "The marketing ploy was aimed at appealing to people in their 20s.",
      "This style of music is appealing to younger audiences."
    ],
    "notes": "'Appealing to' ilgisini çekmek, cazip gelmek anlamındadır."
  },
  {
    "word": "charitable cause",
    "definition": "A purpose or organization focused on helping others in need.",
    "examples": [
      "The fundraiser supported a charitable cause.",
      "Many people donate to charitable causes during the holidays."
    ],
    "notes": "Yardım amaçlı faaliyet veya kuruluş, hayır işi."
  },
  {
    "word": "refute",
    "definition": "To prove that a statement or theory is wrong or false.",
    "examples": [
      "The scientist refuted the old theory with new evidence.",
      "She refuted his claim with clear facts."
    ],
    "notes": "'Refute', çürütmek, yanlış olduğunu kanıtlamak anlamındadır."
  },
  {
    "word": "undermine",
    "definition": "To weaken or damage something gradually or secretly.",
    "examples": [
      "Constant criticism can undermine a person's confidence.",
      "The scandal undermined the politician's credibility."
    ],
    "notes": "'Undermine', zayıflatmak, baltalamak anlamına gelir; genellikle gizli veya dolaylı yollarla olur."
  },
  {
    "word": "compelling rebuttals",
    "definition": "Powerful arguments or responses that effectively contradict or disprove a claim.",
    "examples": [
      "The lawyer presented compelling rebuttals to the accusations.",
      "Her essay included compelling rebuttals to opposing views."
    ],
    "notes": "'Rebuttal' bir iddiaya karşı güçlü cevap/çürütmedir. 'Compelling' burada 'inandırıcı, güçlü' anlamındadır."
  },
  {
    "word": "settle down",
    "definition": "To become calm, relaxed, or stable; to begin to live a quieter and more regular life.",
    "examples": [
      "The children finally settled down after the excitement.",
      "He decided to settle down and start a family."
    ],
    "notes": "Sakinleşmek, düzene girmek veya yerleşmek anlamındadır."
  },
  {
    "word": "stimulate",
    "definition": "To encourage or activate a process or function.",
    "examples": [
      "Melatonin release is stimulated by darkness.",
      "Caffeine can stimulate brain activity."
    ],
    "notes": "Uyarmak, harekete geçirmek anlamındadır."
  },
  {
    "word": "inhibit",
    "definition": "To slow down or prevent a process or reaction.",
    "examples": [
      "Melatonin release is inhibited by light.",
      "Fear can inhibit performance during public speaking."
    ],
    "notes": "Engellemek, baskılamak anlamındadır."
  },
  {
    "word": "alertness",
    "definition": "The quality of being attentive and ready to respond.",
    "examples": [
      "Lack of sleep affects mental alertness.",
      "Drivers must maintain alertness on long trips."
    ],
    "notes": "Uyanıklık, dikkatli olma durumu."
  },
  {
    "word": "advent of the electric light",
    "definition": "The arrival or beginning of something important; in this case, electric lighting.",
    "examples": [
      "The advent of the electric light changed how people sleep.",
      "With the advent of the internet, communication has become easier."
    ],
    "notes": "'Advent' bir şeyin gelişi veya ortaya çıkışı anlamındadır."
  },
  {
    "word": "convenience",
    "definition": "The state of being easy to use or suitable for a purpose.",
    "examples": [
      "Online shopping offers great convenience.",
      "People often choose convenience over health."
    ],
    "notes": "Kolaylık, elverişlilik anlamına gelir."
  },
  {
    "word": "psychological",
    "definition": "Related to the mind and mental processes.",
    "examples": [
      "Sleep deprivation has psychological effects.",
      "She received psychological support after the accident."
    ],
    "notes": "Psikolojik, zihinsel süreçlerle ilgili."
  },
  {
    "word": "physiological",
    "definition": "Related to the physical or biological functions of living organisms.",
    "examples": [
      "Stress causes physiological changes in the body.",
      "Sleep is essential for physiological recovery."
    ],
    "notes": "Fizyolojik, bedenin işleyişiyle ilgili."
  },
  {
    "word": "acute",
    "definition": "Severe or intense; also can mean sharp or highly developed.",
    "examples": [
      "She suffered from acute back pain.",
      "Acute stress can lead to serious health problems."
    ],
    "notes": "Şiddetli, yoğun, ani gelişen anlamına gelir."
  },
  {
    "word": "obesity",
    "definition": "The condition of being very overweight in a way that is unhealthy.",
    "examples": [
      "Obesity increases the risk of heart disease.",
      "Childhood obesity is a growing concern worldwide."
    ],
    "notes": "Aşırı şişmanlık, obezite durumu."
  },
  {
    "word": "go behind the wheel of a car",
    "definition": "To drive a car.",
    "examples": [
      "You shouldn’t go behind the wheel of a car when you’re tired.",
      "He went behind the wheel despite having a suspended license."
    ],
    "notes": "'Behind the wheel' araba kullanmak anlamına gelir."
  },
  {
    "word": "intoxication",
    "definition": "The state of being affected by alcohol or drugs.",
    "examples": [
      "Alcohol intoxication slows down reaction time.",
      "He was arrested for driving under intoxication."
    ],
    "notes": "Zehirlenme veya alkol/uyuşturucu etkisinde olma durumu."
  },
  {
    "word": "presumably",
    "definition": "Used to say that something is likely or assumed to be true.",
    "examples": [
      "Presumably, she missed the train and is running late.",
      "The lights are off, so presumably no one is home."
    ],
    "notes": "Muhtemelen, büyük ihtimalle anlamına gelir."
  },
  {
    "word": "to go into orbit around it",
    "definition": "To start moving in a curved path around a planet or object in space.",
    "examples": [
      "The satellite went into orbit around the Earth.",
      "The spacecraft will go into orbit around Mars next week."
    ],
    "notes": "'Orbit' yörünge anlamına gelir. 'Go into orbit' bir cismin başka bir cismin çevresinde dönmeye başlaması demektir."
  },
  {
    "word": "in composition",
    "definition": "Refers to the makeup or components of something.",
    "examples": [
      "There are too many similarities in composition between Earth and the moon.",
      "The composition of this rock includes various minerals."
    ],
    "notes": "'Composition' bir şeyin içeriği veya yapısı anlamındadır. 'In composition' ise 'yapısal olarak' veya 'bileşim bakımından' demektir."
  },
  {
    "word": "fission",
    "definition": "The process of splitting a nucleus into two or more parts, releasing energy.",
    "examples": [
      "Nuclear fission is used in power plants to generate electricity.",
      "Fission releases a large amount of energy."
    ],
    "notes": "Nükleer fizikte bir çekirdeğin bölünmesi anlamına gelir. Fiziksel bilimlerde önemli bir terim."
  },
  {
    "word": "remained independent from",
    "definition": "To continue existing or functioning separately from something else.",
    "examples": [
      "The country remained independent from colonial rule.",
      "The moon remained independent from the Earth after formation."
    ],
    "notes": "'Independent from' bağımsız olmak, bir şeyden etkilenmemek anlamına gelir."
  },
  {
    "word": "astronomers",
    "definition": "Scientists who study stars, planets, and other objects in space.",
    "examples": [
      "Astronomers discovered a new planet last year.",
      "Many astronomers use telescopes to observe distant galaxies."
    ],
    "notes": "'Astronomer' gökbilimci anlamındadır. Uzayla ilgili bilimsel çalışmaları yapan kişilerdir."
  },
  {
    "word": "was struck by",
    "definition": "To be hit suddenly and forcefully by something.",
    "examples": [
      "Earth was struck by an object approximately one-tenth of its mass.",
      "The car was struck by lightning during the storm."
    ],
    "notes": "'Strike' fiilinin geçmiş hali olan 'was struck by', bir şeyin aniden ve şiddetle vurulması anlamına gelir."
  },
  {
    "word": "to shutter",
    "definition": "To close or cause to close (usually windows or businesses).",
    "examples": [
      "Many shops had to shutter during the economic crisis.",
      "The old factory was shuttered last year."
    ],
    "notes": "'Shutter' genellikle dükkan ya da işletmelerin kapatılması anlamında kullanılır."
  },
  {
    "word": "to disrupt",
    "definition": "To interrupt or disturb the normal course of something.",
    "examples": [
      "Heavy rain disrupted the football match.",
      "The new policy disrupted the usual workflow."
    ],
    "notes": "Bir şeyin normal işleyişini bozmak, kesintiye uğratmak anlamındadır."
  },
  {
    "word": "to disturb",
    "definition": "To interrupt someone’s peace, rest, or concentration.",
    "examples": [
      "Please don’t disturb me while I’m working.",
      "The loud noise disturbed the students during the exam."
    ],
    "notes": "Rahatsız etmek, huzuru bozmak anlamına gelir."
  },
  {
    "word": "to eject",
    "definition": "To force someone or something to leave a place.",
    "examples": [
      "The pilot ejected from the plane just before it crashed.",
      "The machine ejected the faulty product."
    ],
    "notes": "Bir şeyi zorla dışarı atmak, fırlatmak anlamındadır."
  },
  {
    "word": "to impact",
    "definition": "To have a strong effect or influence on something.",
    "examples": [
      "The new law will impact many businesses.",
      "The asteroid impacted the Earth millions of years ago."
    ],
    "notes": "Hem ‘çarpma, darbe’ anlamı hem de ‘etkilemek, etki yapmak’ anlamı vardır."
  },
  {
    "word": "plausible",
    "definition": "Seeming reasonable or probable.",
    "examples": [
      "It is more plausible that the Earth and the moon were never connected.",
      "Her explanation was plausible, so everyone believed her."
    ],
    "notes": "'Plausible' mantıklı, akla yatkın, makul demektir."
  },
  {
    "word": "Earth’s crust",
    "definition": "The outermost solid layer of the Earth.",
    "examples": [
      "Earth’s crust is made of several large tectonic plates.",
      "Volcanoes erupt through cracks in Earth’s crust."
    ],
    "notes": "'Crust' kabuk anlamına gelir, burada Dünya’nın en dış katmanı."
  },
  {
    "word": "off (the western coast)",
    "definition": "Near or away from the coast or shore.",
    "examples": [
      "There is an island off the western coast of the country.",
      "The ship sank off the coast during the storm."
    ],
    "notes": "'Off' bir yerden biraz uzakta veya yakınında anlamında kullanılır."
  },
  {
    "word": "tear apart",
    "definition": "To separate something forcefully into pieces.",
    "examples": [
      "The storm tore apart many houses along the coast.",
      "The argument tore their friendship apart."
    ],
    "notes": "'Tear apart' parçalamak, yırtıp dağıtmak anlamındadır."
  },
  {
    "word": "consolidate",
    "definition": "To make something stronger, more solid, or more unified.",
    "examples": [
      "The company consolidated its position in the market.",
      "She tried to consolidate her notes before the exam."
    ],
    "notes": "Güçlendirmek, sağlamlaştırmak, birleştirmek. Hem soyut şeyler (güç, bilgi, kontrol), hem de somut şeyler için kullanılabilir."
  },
  {
    "word": "I know some Spanish, if that’s any consolation.",
    "definition": "Used to try to offer a small comfort or reassurance in an otherwise disappointing situation.",
    "examples": [
      "I know some Spanish, if that’s any consolation.",
      "We didn’t win, but at least we played well — if that’s any consolation."
    ],
    "notes": "‘If that’s any consolation’ ifadesi, ‘biraz teselli olursa, durumu hafifletirse’ anlamına gelir. Genellikle kötü bir haberi hafifletmeye çalışırken söylenir."
  },
  {
    "word": "They must have let someone go before who isn’t a Spanish major, right?",
    "definition": "Expresses a logical assumption about the past — that at some point, a non-Spanish major must have been allowed to go.",
    "examples": [
      "They must have let someone go before who isn’t a Spanish major, right?",
      "He must have told them already — they look upset."
    ],
    "notes": "‘Must have + V3’ yapısı, geçmişte olmuş olma ihtimali çok yüksek olan bir şeyi ifade eder (mantıksal çıkarım). ‘Let someone go’ burada birini gitmesine izin vermek anlamında kullanılmıştır."
  },
  {
    "word": "I can’t remember the last time a student was able to go who wasn’t a Spanish major.",
    "definition": "Used to express that something rarely (or never) happens — in this case, that non-Spanish majors almost never get the opportunity to go.",
    "examples": [
      "I can’t remember the last time a student was able to go who wasn’t a Spanish major.",
      "I can’t remember the last time it rained this hard in July."
    ],
    "notes": "Bu ifade, nadiren gerçekleşen ya da uzun zamandır olmayan bir durumu vurgular. ‘Spanish major’ ifadesi, üniversitede ana dalı İspanyolca olan öğrenci anlamına gelir. Cümledeki 'who wasn’t a Spanish major' kısmı, önceki ‘student’ kelimesini tanımlar."
  },
  {
    "word": "relevant",
    "definition": "Closely connected or appropriate to the matter at hand.",
    "examples": [
      "Please only include information that is relevant to the topic.",
      "Her comments were not relevant to the discussion."
    ],
    "notes": "Konu ile ilgili, alakalı, yerinde. Genellikle 'relevant to' şeklinde kullanılır."
  },
  {
    "word": "have one's heart set on",
    "definition": "To want something very much or be determined to achieve or get something.",
    "examples": [
      "She has her heart set on studying abroad.",
      "They have their hearts set on buying that house by the beach."
    ],
    "notes": "Bir şeyi çok istemek, gönlünü bir şeye kaptırmak. Genellikle uzun zamandır arzu edilen şeyler için kullanılır."
  },
  {
    "word": "Did you pick up your paper yet?",
    "definition": "A question asking if someone has collected or retrieved their document, assignment, or newspaper.",
    "examples": [
      "Did you pick up your paper yet from the front desk?",
      "I forgot to pick up my paper after class."
    ],
    "notes": "‘Pick up’ fiili burada ‘bir şeyi gidip almak, teslim almak’ anlamında kullanılır. ‘Paper’ kelimesi bağlama göre ‘gazete’, ‘ödev’ ya da ‘belge’ olabilir."
  },
  {
    "word": "dispel",
    "definition": "To drive away or eliminate a thought, feeling, or belief.",
    "examples": [
      "The other choices are mentioned at the beginning of the passage but later dispelled for various reasons.",
      "The scientist tried to dispel the myth with evidence."
    ],
    "notes": "Bir düşünceyi, şüpheyi veya yanılgıyı ortadan kaldırmak, dağıtmak. Genellikle soyut şeyler için kullanılır (örneğin: efsane, korku, şüphe)."
  },
  {
    "word": "narrative",
    "definition": "A story or an account of events, experiences, or the like, whether true or fictional.",
    "examples": [
      "The topic is introduced, followed by an example and a historical narrative.",
      "The documentary presents a compelling narrative of the war."
    ],
    "notes": "Anlatı, öykü ya da olayların anlatımı. Akademik metinlerde 'historical narrative' gibi ifadelerle sıkça kullanılır."
  },
  {
    "word": "we average",
    "definition": "To have an average amount, level, or number over time.",
    "examples": [
      "We average fewer than 7 hours of sleep per day by age 65.",
      "Americans average about 3 cups of coffee per day."
    ],
    "notes": "‘We average’ ifadesi, ‘ortalama olarak ... oluruz/yaparız’ anlamında kullanılır. Burada ‘we average fewer than 7 hours’ demek, ‘ortalama olarak günde 7 saatten az uyuruz’ demektir."
  },
  {
    "word": "sleep deprivation",
    "definition": "The condition of not having enough sleep.",
    "examples": [
      "Sleep deprivation can lead to serious health problems.",
      "College students often suffer from sleep deprivation during exam weeks."
    ],
    "notes": "Yeterince uyuyamama durumu, uyku eksikliği."
  },
  {
    "word": "I really wouldn't want you to get your hopes up.",
    "definition": "Used to warn someone not to expect too much, so they won’t be disappointed.",
    "examples": [
      "I really wouldn't want you to get your hopes up — the position hasn’t been confirmed yet.",
      "He said he might come, but I wouldn’t get my hopes up."
    ],
    "notes": "‘Get your hopes up’ ifadesi, ‘büyük umutlara kapılmak’ anlamına gelir. Bu cümlede ise birini fazla umutlandırmak istemediğini belirtir."
  },
  {
    "word": "I can tell you put a lot of thought into this paper.",
    "definition": "An expression used to show that someone clearly made a strong effort or was very thoughtful while preparing something.",
    "examples": [
      "I can tell you put a lot of thought into this paper. It's well-organized and insightful.",
      "She smiled and said, 'I can tell you put a lot of thought into your gift.'"
    ],
    "notes": "Birinin yaptığı işe çok emek ve dikkat verdiğini belirtmek için kullanılır. 'put a lot of thought into' ifadesi, 'üzerinde çok düşünmek, özen göstermek' anlamına gelir."
  },
  {
    "word": "abandon",
    "definition": "To leave behind or give up completely.",
    "examples": [
      "He had to abandon the car in the snow.",
      "They abandoned the plan due to budget issues."
    ],
    "notes": "Often used in formal/legal contexts."
  },
  {
    "word": "benevolent",
    "definition": "Well meaning and kindly.",
    "examples": [
      "She was a benevolent old lady who loved children."
    ],
    "notes": "Positive connotation."
  },
  {
    "word": "coerce",
    "definition": "To force someone to do something by using threats.",
    "examples": [
      "He was coerced into signing the contract."
    ],
    "notes": "Used especially in legal or political contexts."
  },
  {
    "word": "transcend",
    "definition": "To go beyond the limits of something.",
    "examples": [
      "Her music transcends cultural boundaries.",
      "He tried to transcend his difficulties through meditation."
    ],
    "notes": "Bir şeyin sınırlarını aşmak, üstüne çıkmak."
  },
  {
    "word": "sensory world",
    "definition": "The world experienced through the senses.",
    "examples": [
      "We live in a sensory world full of sights and sounds.",
      "Art can evoke the sensory world in vivid ways."
    ],
    "notes": "Duyu organlarıyla deneyimlenen dünya."
  },
  {
    "word": "attain",
    "definition": "To achieve or reach something after effort.",
    "examples": [
      "She attained her goals through hard work.",
      "Many athletes attain greatness through dedication."
    ],
    "notes": "Çaba sonucu ulaşmak, elde etmek."
  },
  {
    "word": "critical of",
    "definition": "Expressing disapproval or judgment.",
    "examples": [
      "The critics were critical of the new movie.",
      "He was critical of the government's policies."
    ],
    "notes": "Eleştirel olmak, bir şeyi beğenmemek."
  },
  {
    "word": "conformity",
    "definition": "Behaving according to accepted standards or rules.",
    "examples": [
      "She refused to follow social conformity.",
      "Conformity can limit personal creativity."
    ],
    "notes": "Toplumun ya da grubun kurallarına uyma."
  },
  {
    "word": "art that stressed emotion over cold",
    "definition": "Art emphasizing feelings rather than logic or reason.",
    "examples": [
      "Romantic art stressed emotion over cold rationality.",
      "The painting reflects art that stressed emotion over cold techniques."
    ],
    "notes": "Mantıktan çok duyguyu ön plana çıkaran sanat."
  },
  {
    "word": "follow in someone's footsteps",
    "definition": "To do the same things as someone before you, especially as a career.",
    "examples": [
      "He followed in his father’s footsteps and became a doctor.",
      "Many athletes follow in the footsteps of their idols."
    ],
    "notes": "Birinin izinden gitmek, onun yaptığını yapmak."
  },
  {
    "word": "Harvard Divinity School",
    "definition": "A theological seminary of Harvard University.",
    "examples": [
      "Emerson studied at Harvard Divinity School.",
      "Many religious leaders graduated from Harvard Divinity School."
    ],
    "notes": "Harvard Üniversitesi'nin ilahiyat fakültesi."
  },
  {
    "word": "clergy",
    "definition": "People ordained for religious duties, especially in Christian churches.",
    "examples": [
      "The clergy led the Sunday service.",
      "Many members of the clergy attended the conference."
    ],
    "notes": "Din görevlileri, ruhban sınıfı."
  },
  {
    "word": "spirituality",
    "definition": "Concern with the human spirit or soul rather than material things.",
    "examples": [
      "She practices meditation to deepen her spirituality.",
      "Spirituality can bring peace and purpose."
    ],
    "notes": "Maneviyat, ruhsal yön."
  },
  {
    "word": "bustling",
    "definition": "Full of energetic and noisy activity.",
    "examples": [
      "The bustling city streets were crowded with people.",
      "We enjoyed the bustling market atmosphere."
    ],
    "notes": "Canlı, hareketli ve gürültülü."
  },
  {
    "word": "urge",
    "definition": "To strongly encourage or persuade someone to do something.",
    "examples": [
      "The teacher urged the students to study harder.",
      "They urged him to accept the job offer."
    ],
    "notes": "İkna etmek, ısrarla tavsiye etmek."
  },
  {
    "word": "overpower",
    "definition": "To defeat or overcome with superior force.",
    "examples": [
      "The army was able to overpower the enemy.",
      "Fear can sometimes overpower reason."
    ],
    "notes": "Güçle yenmek, baskın çıkmak."
  },
  {
    "word": "strike a chord",
    "definition": "To cause someone to feel sympathy or emotion.",
    "examples": [
      "Her story struck a chord with many listeners.",
      "The film struck a chord with audiences worldwide."
    ],
    "notes": "Birinin duygularına dokunmak."
  },
  {
    "word": "drawn",
    "definition": "Attracted or pulled towards something.",
    "examples": [
      "Many writers were drawn to transcendentalism.",
      "She felt drawn to the city’s vibrant culture."
    ],
    "notes": "Çekilmek, ilgi duymak."
  },
  {
    "word": "to permeate",
    "definition": "To spread throughout something.",
    "examples": [
      "The smell of coffee permeated the room.",
      "Ideas of freedom began to permeate the society."
    ],
    "notes": "Bir şeye yayılmak, nüfuz etmek."
  },
  {
    "word": "attracted to",
    "definition": "Having a liking or interest towards something or someone.",
    "examples": [
      "Many were attracted to Emerson’s ideas.",
      "She was attracted to his kindness."
    ],
    "notes": "Bir şeye veya kişiye ilgi duymak."
  },
  {
    "word": "disgust over",
    "definition": "Strong feeling of dislike or disapproval.",
    "examples": [
      "He expressed disgust over the unfair treatment.",
      "There was public disgust over the corruption scandal."
    ],
    "notes": "Tiksinti, hoşlanmama."
  },
  {
    "word": "prominence",
    "definition": "The state of being important or famous.",
    "examples": [
      "Margaret Fuller came to prominence as a leading transcendentalist.",
      "The artist gained prominence after the exhibition."
    ],
    "notes": "Öne çıkma, ün kazanma."
  },
  {
    "word": "towering intellect",
    "definition": "A person with very great intelligence.",
    "examples": [
      "He was regarded as a towering intellect in philosophy.",
      "Her towering intellect inspired many students."
    ],
    "notes": "Yüksek zeka, üstün akıl."
  },
  {
    "word": "compulsive",
    "definition": "Resulting from an irresistible urge.",
    "examples": [
      "He has a compulsive habit of checking his phone.",
      "Compulsive behaviors can be hard to control."
    ],
    "notes": "Kontrol edilemeyen dürtüsel."
  },
  {
    "word": "tale",
    "definition": "A story, often one that is imaginative or traditional.",
    "examples": [
      "The old man told a fascinating tale.",
      "Fairy tales often have magical creatures."
    ],
    "notes": "Masal, hikaye."
  },
  {
    "word": "single-minded quest",
    "definition": "A very focused and determined search or mission.",
    "examples": [
      "Captain Ahab’s single-minded quest was to kill the white whale.",
      "Her single-minded quest for success inspired everyone."
    ],
    "notes": "Tek amaçlı, kararlı arayış."
  },
{
    "word": "fertile",
    "definition": "Capable of producing abundant vegetation or crops.",
    "examples": [
      "The region has fertile soil ideal for farming.",
      "Fertile lands produce higher crop yields."
    ],
    "notes": "Verimli, ürün vermeye elverişli (toprak için)."
  },
  {
    "word": "crops",
    "definition": "Plants that are grown for food or other agricultural purposes.",
    "examples": [
      "Farmers harvest their crops in the fall.",
      "Rice and wheat are common staple crops."
    ],
    "notes": "Tarım ürünleri, ekin."
  },
  {
    "word": "cropland",
    "definition": "Land used to grow crops.",
    "examples": [
      "Much of the region’s cropland is irrigated.",
      "Cropland is shrinking due to urban expansion."
    ],
    "notes": "Tarla, ekili arazi."
  },
  {
    "word": "ill-suited",
    "definition": "Not appropriate or fitting for a particular purpose or situation.",
    "examples": [
      "This dry land is ill-suited for rice farming.",
      "His personality was ill-suited to leadership."
    ],
    "notes": "Uygun olmayan, elverişsiz."
  },
  {
    "word": "thrive",
    "definition": "To grow or develop well or vigorously.",
    "examples": [
      "Plants thrive in a nutrient-rich environment.",
      "Some businesses thrive even in tough economic times."
    ],
    "notes": "Gelişmek, serpilmek, başarılı olmak."
  },
  {
    "word": "the nutrient solution flows constantly past the roots of the plants",
    "definition": "A method in which liquid nutrients continuously move around plant roots.",
    "examples": [
      "In hydroponics, the nutrient solution flows constantly past the roots of the plants.",
      "This system ensures that the plants receive oxygen and nutrients at all times."
    ],
    "notes": "Besin çözeltisi sürekli olarak bitki köklerinin etrafında dolaşır."
  },
  {
    "word": "distilled water",
    "definition": "Purified water that has been boiled into vapor and condensed back into liquid.",
    "examples": [
      "They used distilled water in the hydroponic system.",
      "Distilled water is free from minerals and impurities."
    ],
    "notes": "Damıtılmış, saf su."
  },
  {
    "word": "facilities can be located in or near cities",
    "definition": "Farming or production centers can be placed close to urban areas.",
    "examples": [
      "Hydroponic facilities can be located in or near cities to reduce transportation costs.",
      "Urban farms are facilities located near city centers."
    ],
    "notes": "Tesisler şehir içinde veya yakınında konumlandırılabilir."
  },
  {
    "word": "farmers can grow crops",
    "definition": "Farmers have the ability to cultivate food plants.",
    "examples": [
      "With hydroponics, farmers can grow crops year-round.",
      "Farmers can grow crops indoors without soil."
    ],
    "notes": "Çiftçiler ürün yetiştirebilir."
  },
  {
    "word": "herbs and vegetables",
    "definition": "Types of edible plants used for flavor or nutrition.",
    "examples": [
      "They grow fresh herbs and vegetables in their backyard.",
      "Hydroponics is ideal for growing herbs and vegetables like basil and lettuce."
    ],
    "notes": "Otlar ve sebzeler."
  },
  {
    "word": "staple crops",
    "definition": "Basic food crops that are grown in large quantities and form the main part of a diet.",
    "examples": [
      "Wheat, rice, and corn are staple crops around the world.",
      "Staple crops provide most of the population’s calories."
    ],
    "notes": "Temel gıda ürünleri."
  },
  {
    "word": "cultivation",
    "definition": "The process of growing plants for food or other uses.",
    "examples": [
      "Soil preparation is essential for successful cultivation.",
      "The cultivation of tomatoes has increased in recent years."
    ],
    "notes": "Tarım, ekim-dikim."
  },
  {
    "word": "vital",
    "definition": "Absolutely necessary or essential.",
    "examples": [
      "Clean water is vital for plant growth.",
      "It is vital to follow safety procedures in the lab."
    ],
    "notes": "Hayati, çok önemli."
  },
  {
    "word": "nutrient-rich water",
    "definition": "Water that contains essential nutrients for plant growth.",
    "examples": [
      "Hydroponic systems use nutrient-rich water instead of soil.",
      "The plants absorb minerals from the nutrient-rich water."
    ],
    "notes": "Besin maddeleri açısından zengin su."
  }
]
